window.incidentMap = {"2530":[{"date":"2530","location":"Thai Petrochemical Industry Ltd. (TPI) จ.ระยอง","incident":"เพลิงลุกไหม้จากการรั่วไหลของเอทิลีน (Ethylene)","effect":"ไม่มีรายงานความเสียหาย"}],"2538":[{"date":"2538","location":"Thai Petrochemical Industry Ltd. (TPI) จ.ระยอง","incident":"เพลิงลุกไหม้จากการรั่วไหลของเอทิลีน (Ethylene)","effect":"ไม่มีรายงานความเสียหาย"}],"2542":[{"date":"6/12/2542","location":"ถนนสาย 3138 (ระยอง-บ้านค่าย) อ.เมือง จ.ระยอง","incident":"รถบรรทุกกรดไฮโดรคลอริก 35% ขนาด 11 ตัน ของบริษัทซีแอลทราน สปอร์ต จำกัด ระเบิดและรั่วไหล เกิดควันของไอกรดฟุ้งกระจาย","effect":"มีผู้เจ็บป่วยจากการสูดดมก๊าซไฮโดรคลอริก 5 ราย"}],"2543":[{"date":"3/6/2543","location":"บริษัทไทยโพลีคาร์บอเนต จำกัด นิคมอุตสาหกรรมผาแดง อ.เมือง จ.ระยอง","incident":"ท่อส่งก๊าซคาร์บอนิลคลอไรด์ (ฟอสจีน) เกิดการแตกรั่ว","effect":"ประชาชนได้รับอันตรายจากการสูดดมก๊าซพิษจำนวนมาก เสียชีวิต 1 คน "},{"date":"6/18/2543","location":"ทางหลวงในเขต กิ่ง อ.พนัสนิคม จ.ระยอง","incident":"รถบรรทุก 10 ล้อ ขนโซดาไฟ พลิกคว่ำลงคลอง ทำให้โซดาไฟที่บรรจุในถุงละลายไปกับน้ำ","effect":"คนขับรถเสียชีวิต 1 คนโซดาไฟแพร่กระจายเป็นระยะทาง 8 กม. ทำให้ปลาตายจำนวนมาก"},{"date":"11/23/2543","location":"ต.มาบตาพุด อ.เมือง จ.ระยอง","incident":"รถขนกรดซัลฟูริก 98% ความจุ 12 ตัน พุ่งชนรถคันอื่น ทำให้กรด ซัลฟูริกไหลลงคลองข้างทาง","effect":"บาดเจ็บ 2 ราย"}],"2544":[{"date":"1/1/2544","location":"ท่าเทียบเรือ บ.อุตสาหกรรมปิโตรเคมีกัลไทย จำกัด จ.ระยอง","incident":"เรือบรรทุกแอมโมเนียมไนเตรทปริมาณ 125 ตู้คอนเทนเนอร์ล่มขณะขนย้ายสินค้าลงเรือ","effect":"ปลาตายจากสารเคมีรั่วไหล"},{"date":"3/4/2544","location":"อ.เมือง จ.ระยอง","incident":"รถบรรทุกเทรเลอร์บรรทุกโซดาไฟพลิกตะแคงในซอยเข้าหมู่บ้านตะกาด หมู่ 4 ต.ตะพง อ.เมือง จ.ระยอง สารเคมีไหลลงสู่แหล่งน้ำ","effect":"สารเคมีไหลลงสู่แหล่งน้ำกินของสัตว์เลี้ยงบริเวณทุ่งนา และมีปลาตายจำนวนมาก"},{"date":"3/5/2544","location":"นิคมอุตสาหกรรมมาบตาพุด อ.เมือง จ.ระยอง","incident":"รถบรรทุกสารเคมีซีโฟร์พลิกคว่ำขณะนำส่งสารเคมีที่บริษัทอุตสาหกรรมปิโตรเคมีกัลไทย จำกัด","effect":"ไม่มีรายงานความเสียหาย"},{"date":"3/6/2544","location":"นิคมอุตสาหกรรมมาบตาพุด อ.เมือง จ.ระยอง","incident":"รถบรรทุกของบริษัทเซออนเคมิคอล ซึ่งบรรทุกสาร Butadiene Raffinate จำนวน 16 ตัน พลิกคว่ำ","effect":"ไม่มีรายงานความเสียหาย"},{"date":"3/7/2544","location":"บ้านตะกาด หมู่ 4 ต.ตะพง อ.เมือง จ.ระยอง","incident":"รถบรรทุกสารเคมีพลิกคว่ำ  ทำให้สารเคมีซึ่งคาดว่าเป็นแคลเซียมออกไซด์ (CaO) หกหล่นและถูกทิ้งไว้ในบริเวณนั้น","effect":"ส่งผลกระทบต่อดินและหญ้าในบริเวณดังกล่าว ทำให้ดินมีสีจางลง และหญ้าตาย"},{"date":"6/18/2544","location":"ถนนสาย 3138 (ระยอง-บ้านค่าย) อ.เมือง จ.ระยอง","incident":"รถบรรทุกกรดไฮโดรคลอริก 35% ขนาด 11 ตันของบริษัทซีแอลทราน สปอร์ต จำกัด ระเบิดและรั่วไหล ","effect":"กรดไฮโดรคลอริกรั่วไหลลงพื้นถนนเป็นระยะทาง 25 กม. มีผู้เจ็บป่วยจากการสูดดมกรด 5 ราย"}],"2545":[{"date":"4/10/2545","location":"บริษัทไทยโดโน-เกนเกน จำกัดกิ่ง อ.นิคมพัฒนา จ.ระยอง","incident":"เกิดการระเบิดของสารเคมีในถังผสมสาร (ไนโตรเซลลูโลส และสารไวไฟหลายชนิด)","effect":"อาคารผลิตเสียหายทั้งหลัง มูลค่าความเสียหาย50 ล้านบาท และเกิดก๊าซพิษ"},{"date":"4/13/2545","location":"บริษัทเอสทีดี พรีซีซัน จำกัด อ.บ้านฉาง จ.ระยอง","incident":"ไฟไหม้โรงงานผลิตพลาสติก","effect":"ความเสียหายมากกว่า 60 ล้านบาท"},{"date":"5/3/2545","location":"ถนน By-pass สาย 36 กิ่ง อ.นิคมพัฒนา จ.ระยอง","incident":"รถบรรทุกสาร White Oil ของบริษัท S&R Transport ประสบอุบัติเหตุชนกับรถกระบะ ทำให้สารเคมีรั่วไหลลงสู่พื้นถนน","effect":"กลิ่นจากไอระเหยของสาร ทำให้เกิดการระคายเคืองตา ผิวหนัง และระบบทางเดินหายใจ"},{"date":"6/25/2545","location":"ห้างหุ้นส่วนจำกัด ไทยผลิตภัณฑ์ก๊าซ ต.เนินพระ อ.เมือง จ.ระยอง","incident":"เกิดเหตุระเบิดที่โรงงานบรรจุก๊าซ ขณะคนงานถ่ายก๊าซจากถังใหญ่ลงถังเล็ก","effect":"โรงงานได้รับความเสียหาย คนงานเสียชีวิต 1 ราย และได้รับบาดเจ็บ 1 ราย"},{"date":"12/11/2545","location":"ชุมชนบ้านชากกลาง หมู่ 4 ต.ห้วยโป่ง อ.เมือง จ.ระยอง","incident":"โรงงานอุตสาหกรรมลักลอบนำน้ำกรดมาทิ้ง","effect":"น้ำในคลองเน่าเสีย  เมื่อถูกตามร่างกายจะคันและแสบมาก"}],"2547":[{"date":"12/3/2547","location":"โรงงานซีพีเจริญโภคภัณฑ์ปิโตรเคมี จำกัด กิ่งอำเภอนิคมพัฒนา จ.ระยอง","incident":"เพลิงไหม้โกดังเก็บวัตถุดิบสำหรับผลิตพีวีซีหรือพลาสติกแผ่นแข็ง","effect":"เพลิงใหม้กว่า 2 ชั่วโมง สูญเสียไม่ต่ำกว่า 100 ล้านบาท"}],"2548":[{"date":"9/20/2548","location":"โรงงานแปรรูปอาหารทะเลบริษัท เจริญโภคภัณฑ์อาหาร จำกัด จ.ระยอง","incident":"แอมโมเนียรั่วออกมาจากท่อส่งที่ผุกร่อน","effect":"ไม่มีรายงานความเสียหาย"},{"date":"9/22/2548","location":"บริษัท มิยูกิ อินดัสทรี (ประเทศไทย) จำกัด นิคมอุตสาหกรรมสยามอิสเทิร์น","incident":"เพลิงไหม้ถังน้ำมันเตาและน้ำมันดีเซล","effect":"น้ำมันเตาและน้ำมันดีเซลไหม้ไฟไปอย่างละประมาณ 3 หมื่นลิตร"}],"2549":[{"date":"5/4/2549","location":"ท่าเรือโรงกลั่นน้ำมัน บริษัท อัลลายแอนซ์ รีไฟน์นิ่ง จำกัด นิคมอุตสาหกรรมมาบตาพุต อ. เมือง จ. ระยอง","incident":"น้ำมันเตารั่วไหลลงทะเล ขณะกำลังขนถ่ายจากคลังน้ำมันลงเรือ CT 34 ประเทศไทย","effect":"น้ำมันเตารั่วไหลลงทะเลประมาณ 15,000 ลิตร"},{"date":"11/3/2549","location":"ถนนสาย 36 กม.31 หมู่ 6 ต.มะขามคู่ อ.นิคมพัฒนา จ.ระยอง","incident":"รถบรรทุกสารแมททิวลีน บรรจุถัง 200 ลิตร จำนวน 4 ถัง และสารเคมีทินเนอร์ บรรจุถัง 20 ลิตร จำนวน 7 ถัง พลิกคว่jeเกิดไฟลุกไหม้ทั้งคัน","effect":"มีผู้บาดเจ็บเล็กน้อย 1 ราย"},{"date":"11/16/2549","location":"บริษัทบริหารและพัฒนาเพื่อการอนุรักษ์สิ่งแวดล้อม จำกัด (มหาชน) ถ.ไอ2 นิคมอุตสาหกรรมมาบตาพุด จ.ระยอง","incident":"คนงานใช้รถแบ็คโฮผสมขยะในบ่อปรับเสถียรและเติมสารเคมีลงไป ทำให้เกิดประกายไฟลุกใหม้กองขยะ","effect":"ไม่มีรายงานความเสียหาย"},{"date":"12/5/2549","location":"ปั๊มน้ำมัน ตันติชัย จำกัด ริมถนนสุขุมวิทเลขที่ 227/10 หมู่ 6 ริมถนนสุขุมวิท ต.ทุ่งควายกิน อ.แกลง จ.ระยอง","incident":"มีการรั่วไหลของสารระเหยอินทรีย์หลายชนิด โดยเฉพาะสารไฮโดรปิโตรเลียม จากถังเก็บสารเคมีในบริเวณปั้มน้ำมัน","effect":"ประชาชนบริเวณรอบ 300 เมตรสูดดมสารเคมีเกิดการอาเจียน หน้ามืด วิงเวียน และหมดสติ"}],"2550":[{"date":"1/2/2550","location":"บริษัท จิ้งฮงระยอง จำกัด 81/4 ถนนสายบายพาส 36 ต.เชิงเนิน อ.เมือง จ.ระยอง","incident":"ไฟไหม้โรงงานเก็บเม็ดพลาสติก","effect":"ไม่มีรายงานความเสียหาย"},{"date":"1/9/2550","location":"โรงงานบริษัท ไออาร์พีซี (ทีพีไอ) ต. เชิงเนิน อ. เมืองระยอง","incident":"ไฟไหม้ถังเก็บสารเอทธิลีน ภายในแทงก์ฟาร์มของโรงงานบริษัท ไออาร์พีซี (ทีพีไอ)","effect":"เพลิงไหม้ถังเก็บสารเอทธิลีน 1 ลูก"},{"date":"2/18/2550","location":"บริเวณถนนบายพาสระยอง-กระทิงลาย ต.มะขามคู่ กิ่ง อ.นิคมพัฒนา จ. ระยอง","incident":"เกิดไฟไหม้ที่เครื่องยนต์ ภายในรถบรรทุกเม็ดพลาสติกกว่า 1,000 ตัน","effect":"มูลค่าความเสียหายกว่า 1 ล้านบาท"},{"date":"8/27/2550","location":"บริเวณป่าริมถนนสายบายพาส 36 ระหว่างหลักกิโลเมตร 35-36 เขตเทศบาลเมืองมาบตาพุด จ.ระยอง","incident":"ลักลอบทิ้งกากของเสียจากโรงงานอุตสาหกรรม","effect":"ส่งกลิ่นเหม็นรุนแรงไปทั่วบริเวณ"}],"2551":[{"date":"2/6/2551","location":"ภายในซอยกอไผ่ ต.เนินพระ เขตเทศบาลเมืองมาบตาพุด จ.ระยอง","incident":"มีการลักลอบทิ้งสารเคมี ลักษณะสีขาวข้นจำนวนมาก","effect":"บาดเจ็บ 4 ราย มีอาการเจ็บคอ หายใจไม่สะดวก เวียนศีรษะ อ่อนเพลีย มีผื่นและแสบผิวหนัง"},{"date":"6/10/2551","location":"บริษัท พีทีที ฟีนอล จำกัด นิคมอุตสาหกรรมเหมราช  ถนนปกรณ์สงเคราะห์ ต.ห้วยโป่ง อ.เมือง จ.ระยอง","incident":"ท่อส่งสารคิวมีน (Cumene) ขนาด 6 นิ้ว รั่วไหล ทำให้ก๊าซพิษกระจายไปทั่วโรงงาน","effect":"มีผู้ได้รับบาดเจ็บจากการสูดดมก๊าซพิษทั้งสิ้น 112 ราย ในจำนวนนี้มีอาการสาหัส 33 ราย"},{"date":"9/6/2551","location":"ริมถนนสาย 36 หมู่ 2 ต.เชิงเนิน จ.ระยอง","incident":"ลักลอบทิ้งกากของเสียอุตสาหกรรม ลักษณะเป็นก้อนสีดำจำนวนมาก","effect":"ส่งกลิ่นเหม็น ฟุ้งกระจายไปทั่วบริเวณ"}],"2552":[{"date":"1/31/2552","location":"บริเวณชายหาดแหลมรุ่งเรือง ใกล้กับท่าเทียบเรือของ บริษัท ไออาร์พีซี จำกัด (มหาชน) จ. ระยอง","incident":"น้ำมันจำนวนมากรั่วไหลออกมาจากเรือบรรทุกน้ำมัน กระจายลงทะเลเป็นบริเวณกว้าง","effect":"คราบน้ำมันแผ่ครอบคลุมพื้นที่เป็นบริเวณกว้าง และถูกคลื่นลมพัดเข้าสู่ชายฝั่งทะเล"},{"date":"2/13/2552","location":"บริษัท ปตท. เคมีคอล จำกัด (มหาชน) ถนนไอ นิคมอุตสาหกรรมมาบตาพุด ต.ห้วยโป่ง อ.เมือง จ.ระยอง","incident":"ก๊าซไฮโดรเจนซัลไฟด์รั่วไหล ","effect":"คนงานและผู้รับเหมาจำนวน 27 ราย มีอาการวิงเวียนศีรษะ แน่นหน้าอก หายใจไม่ออก มี 4 รายอาการสาหัส"},{"date":"3/2/2552","location":"พื้นที่รกร้างริมคลองน้ำหูคลองสาธารณะ เขตเทศบาลเมืองมาบตาพุด จ.ระยอง","incident":"มีการลักลอบนำขยะสารเคมีจากโรงงานผลิตเม็ดพลาสติกมาทิ้ง","effect":"กากขยะสารเคมีส่งกลิ่นเหม็นฉุนรุนแรงทั่วบริเวณ"},{"date":"5/7/2552","location":"บริษัท ไทยคูน เวิลด์ไวด์กรุ๊ป (ประเทศไทย) จำกัด 99 ม.1 นิคมอุตสาหกรรมระยอง อ.นิคมพัฒนา จ.ระยอง","incident":"ไฟไหม้บริเวณบ่อน้ำมันออแกไนซ์จำนวน 7 บ่อ ภายในโรงงานหลอมเหล็ก","effect":"ไม่มีรายงานความเสียหาย"}],"2555":[{"date":"5/5/2555","location":"นิคมอุตสาหกรรมมาบตาพุด อ.เมือง จ.ระยอง","incident":"เหตุเพลิงไหม้โรงงานของบริษัท บีเอสที อิลาสโตเมอร์ส จำกัด ในเครือบริษัท กรุงเทพ ซินธิติกส์ จำกัด   ","effect":"มีผู้เสียชีวิต 11 คนและบาดเจ็บ 181 คน"}]}
window.eventMap = {"2523":[{"date":"ธค. 2523","incident":"รัฐบาลพล.อ.เปรม ติณสูลานนท์ ตั้งคณะกรรมการพัฒนาพื้นที่บริเวณชายฝั่งทะเลตะวันออก(กพอ.)โดยมีพล.อ.เปรมเป็นประธาน"}],"2524":[{"date":"มค. 2524","incident":"นายกรัฐมนตรี ซูซูกิ ของญี่ปุ่นแถลงการณ์ด้านความร่วมมือในการพัฒนาอีสเทิรน์ซีบอร์ด"},{"date":"เมย. 2524","incident":"คณะรัฐมนตรีอนุมัติแผนพัฒนาพื้นที่บริเวณชายฝั่งทะเลตะวันออก"},{"date":"ตค. 2524","incident":"โครงการพัฒนาพื้นที่บริเวณชายฝั่งตะวันทะเลตะวันออกถูกบรรจุในแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติฉบับที่ 5"}],"2527":[{"date":"กย. 2527","incident":"ก่อตั้งการปิโตรเลียมแห่งประเทศไทย(ปตท.)"},{"date":"ธค. 2527","incident":"เริ่มทดลองเดินเครื่องโรงแยกก๊าซ"}],"2528":[{"date":"กพ. 2528","incident":"รัฐบาลไทยศึกษาความเป็นไปได้และแผนแม่บท โครงการพัฒนาพื้นที่ชายฝั่งมาบตาพุดท่าเรือแหลมฉบังและนิคมอุตสาหกรรม"}],"2529":[{"date":"พย. 2529","incident":"เริ่มโครงการปิโตรเคมิเคิล(NPC-1)ระยะที่ 1 ในพื้นที่บริเวณนิคมอุตสาหกรรมมาบตาพุด"}],"2530":[{"date":"กพ. 2530","incident":"รัฐบาลดำเนินโครงการนิคมอุตสาหกรรมมาบตาพุด"}],"2531":[{"date":"มค. 2531","incident":"รัฐบาลไทยตัดสินใจดำเนินโครงการท่าเรือน้ำลึกมาบตาพุดและอนุมัติโครงการปิโตเคมิเคิลระยะที่ 2 (NPC-2)"},{"date":"สค. 2531","incident":"ประกาศใช้กฎกระทรวงผังเมืองรวมบริเวณอุตสาหกรรมหลักและชุมชน จ.ระยอง ฉบับที่ 46 (พ.ศ. 2531)"}],"2532":[{"date":"พค. 2532","incident":"ปรับปรุงผังเมืองรวมครั้งที่ 1 เนื่องจากพื้นที่ในเขตอุตสาหกรรมไม่เพียงพอต่อคามต้องการของอุตสาหกรรม"},{"date":"ตค. 2532","incident":"โครงการปิโตรเคมิเคิล(NPC-2)ระยะที่ 2 เริ่มเปิดดำเนินการ"}],"2534":[{"date":"พค. 2534","incident":"ประกาศใช้กฎกระทรวงผังเมืองรวมบริเเวณอุตสาหกรรมหลักและชุมชน จ.ระยอง ฉบับที่ 102  (พ.ศ. 2534)"}],"2538":[{"date":"2538","incident":"เริ่มโครงการพฒนาชายฝั่งทะเลตะวันออกระยะที่ 2 "}],"2540":[{"date":"2540","incident":"มีการขยายพื้นที่อุตสาหกรรมเข้าไปสู่พื้นที่ตอนในโดยเฉพาะอ.ปลวกแดง เริ่มเกิดปัญหามลพิษทางอากาศ ครูและนักเรียนโรงงานมาบตาพุดพันพิทยาคาร ถูกหามส่งโรงพยาบาล \nเนื่องจากได้รับกลิ่นสารเคมีรุนแรง "}],"2546":[{"date":"12 พค. 2546","incident":"ประกาศใช้กฎกระทรวงผังเมืองรวมบริเวณอุตสาหกรรมหลักและชุมชน จังหวัดระยอง พ.ศ. 2546 "},{"date":"กค. 2546","incident":"ก่อสร้างโรงไฟฟ้าถ่านหินบีแอลซี"}],"2548":[{"date":"2548","incident":"วางแผนแม่บทอุตสาหกรรมปิโตรเคมีเฟสที่ 3 / แก้ไขข้อกำหนดผังเมือง อ. บ้านฉาง เพื่ออนุญาตอุตสาหกรรมปิโตรเคมีขั้นต้น"}],"2550":[{"date":"11 มค. 2550","incident":"คณะกรรมการสิ่งแวดล้อมแห่งชาติมีมติแต่งตั้งคณะอนุกรรมการเฉพาะกิจเพื่อแก้ไขปัญหามลพิษและกำหนดการพัฒนาในพื้นที่จ.ระยองเพื่อจัดทำและกำกับแผนปฎิบัติการลดและขจัดมลพิษ"},{"date":"1 ตค. 2550","incident":"ชาวมาบตาพุดฟ้องคณะกรรมการสิ่งแวดล้อมแห่งชาติต่อศาลปกครองจ.ระยอง เพื่อให้ประกาศให้มาบตาพุดและพื้นที่ใกล้เคียงเป็นเขตควบคุมมลพิษ"}],"2551":[{"date":"ธค. 2551","incident":"ระงับแผนแม่บทอุตสาหกรรมปิโตรเคมีเฟส 3 ชั่วคราว"}],"2552":[{"date":"3 มีค. 2552","incident":"ศาลปกครองมีคำสั่งให้ท้องที่ของเทศบาลเมืองมาบตาพุดและพื้นที่ใกล้เคียง เป็นเขตควบคุมมลพิษ ตามมาตรา 59 ตามกฎหมายสิ่งแวดล้อม 2535"},{"date":"30 เมย. 2552","incident":"ประกาศคณะกรรมการสิ่งแวดล้อมแห่งชาติฉบับที่ 32(พ.ศ. 2552)เรื่องกำหนดให้ท้องที่เขตตำบลมาบตาพุด ห้วยโป่ง เนินพระ ทับมา มาบข่า บ้านฉาง อ.เมืองระยอง \nรวมทั้งพื้นที่ทะเลภายในแนวเขตเป็นเขตควบคุมมลพิษ"},{"date":"19มิย. 2552","incident":"สมาคมต่อต้านสภาวะโลกร่วมกับชาวบ้านใน ต.มาบตาพุด และตำบลใกล้เคียงรวม 43 คน ยื่นฟ้องคณะกรรมการสิ่งแวดล้อมแห่งชาติกับพวกรวม 8 คน ต่อศาลปกครองกรณีร่วมกันออกคำสั่ง\nไม่ถูกต้องตามรัฐธรรมนูญปี 2550 มาตรา 67 วรรคสอง "},{"date":"29กย. 2552","incident":"ศาลปกครองชั้นต้นมีคำสั่งกำหนดมาตรการหรือวิธีการเพื่อบรรเทาทุกข์ชั่วคราวให้ผู้ถูกฟ้องคดีทั้ง 8 สั่งระงับโครงการหรือกิจกรรมที่กำลังดำเนินการก่อสร้างในพื้นที่ ต.มาบตาพุด, อ.บ้านฉาง\n และใกล้เคียง จ.ระยอง ที่เป็นโครงการหรือกิจการที่มีผลกระทบรุนแรง รวม 76 โครงการไว้ชั่วคราวจนกว่าศาลจะมีคำพิพากษา"},{"date":"18พย. 2552","incident":"รัฐบาลแต่งตั้งคณะกรรมการแก้ไขปัญหาการปฏิบัติตามมาตรา 67 วรรค 2 ตามรัฐธรรมนูญเพื่อแก้ไขปัญหาสภาพแวดล้อมในมาบตาพุดจากกรณีประชาชนฟ้องต่อศาลปกครองให้ระงับการก่อสร้างโครงการที่น่าจะมีผลกระทบต่อสิ่งแวดล้อมและสุขภาพ มีการตั้งคณะกรรมการ 4 ฝ่าย โดยมีนายอานันท์ ปันยารชุน เป็นประธาน ร่วมกันกำหนดทิศทางและแนวทางแก้ไขปัญหามลพิษที่จะไม่กระทบเศรษฐกิจ และจัดตั้งองค์การอิสระด้านสิ่งแวดล้อมและสุขภาพ  ทำหน้าที่เพื่อให้ความเห็นเพิ่มเติม นอกจากรายงานผลกระทบสิ่งแวดล้อมและสุขภาพ\n"},{"date":"2ธค. 2552","incident":"ศาลปกครองมีคำสั่งแก้คำสั่งของศาลปกครองชั้นต้น โดยมีคำสังให้ชะลอ 65 โครงการในนิคมอุตสาหกรรมมาบตาพุดและบริเวณใกล้เคียง โดยให้ 11 โครงการที่ไม่มีผลกระทบต่อสิ่งแวดล้อม\nสามารถดำเนินการได้ ได้แก่ โครงการเชื้อเพลิงและแก๊ส 4 โครงการ โครงการเหล็ก 2 โครงการ และปิโตรเคมีและเคมีภัณฑ์ 5 โครงการ"},{"date":"15ธค. 2552","incident":"จากเหตุการณ์ก๊าซรั่วในนิคมอุตสาหกรรมมาบตาพุดหลายครั้งที่ผ่านมาทำให้ผู้ประกอบการในนิคมได้ประสานงานกับศูนย์เฝ้าระวังและควบคุมคุณภาพสิ่งแวดล้อม(EMC2) ของสำนักงานนิคมอุตสาหกรรมมาบตาพุด(สนพ.)จัดตั้งวอร์รูมและทีมเฝ้าระวังสิ่งแวดล้อมตรวจพื้นที่ตลอด 24 ชั่วโมง"}],"2553":[{"date":"19มค. 2553","incident":"ครม.อนุมัติแต่งตั้งคณะกรรมการการประสานงานองค์กรอิสระซึ่งจะเป็นผู้ให้ความเห็นชอบต่อโครงการรุนแรงโดยมีนายอานันท์ ปันยารชุนเป็นประธาน"},{"date":"22มค. 2553","incident":"ศาลปกครองกลางมีคำสั่งยกคำร้อง 30 โครงการที่ยื่นเสนอให้ซาลปกครองกลางทบทวนคำสั่งคุ้มครองชั่วคราวให้ระงับการดำเนินการ"},{"date":"26มค. 2553","incident":"ครม.ตั้งคณะกรรมการประสานให้คำปรึกษาภาคเอกชนในการดำเนินการตามม.67(2) โดยมีนายสุรยุทธ เพชรตระกูล ผู้ช่วยรัฐมนตรีอุตสาหกรรมในขณะนั้นเป็นประธาน"},{"date":"11 พค. 2553","incident":"ประกาศใช้กฎกระทรวงผังเมืองรวมบริเวณอุตสาหกรรมหลักและชุมชน จังหวัดระยอง พ.ศ. 2546 หมดอายุ(ขยายอายุการบังคับใช้ 2 ครั้งๆละ 1 ปี) ดำเนินการปรับปรุงผังเมืองรวมบริเวณ\nอุตสาหกรรมหลักและชุมชนจ.ระยองใหม่แทนผังเมืองเดิม โดยว่าจ่างบริษัทพิสุทธิ์ เทคโนโลยี จำกัดเป็นที่ปรึกษา"},{"date":"31 สค. 2553","incident":"มติครม.รับรอง 11 โครงการรุนแรง เรื่องร่างประกาศกระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม เรื่องกำหนดประเภท ขนาด และวิธีปฎิบัสำหรับโครงการหรือกิจการที่อาจก่อให้เกิดผลกระทบ ต่อชุมชนอย่างรุนแรงทั้งทางด้านคุณภาพ สิ่งแวดล้อม ทรัพยากรธรรมชาติละสุขภาพที่ส่วนราชการรัฐวิสาหกิจหรือเอกชนจะต้องจัดทำรายงานการวิเคราะห์ผลกระทบสิ่งแวดล้อมพ.ศ. 2553"},{"date":"1 กย. 2553","incident":"องค์กรภาคประชาชนออกแถลงการณ์คัดค้านมติครม.เมื่อวันที่ 31 สค. 2552 ที่ไม่เป็นไปตามข้อเสนอของคณะกรรมการ 4 ฝ่ายที่เสนอให้กำหนดทั้งหมด 18 ประเภทโครงการที่ละเมิดสิทธิของ\nประชาชนตามม. 67 วรรค 2"},{"date":"2 กย. 2553","incident":"ศาลปกครองกลาง มีคำสั่งให้ 74 โครงการสามารถดำเนินการต่อไปได้ โดยมี 2 โครงการที่ไม่ผ่านคือ โครงกางโรงงานผลิตเอทิลีนออกไซด์และเอทิลีน ไกลคอน ของบ.ทีโอซี ไกลคอน จำกัดในเครือบมจ.ปตท.เคมิคอล และโครงการขยายกำลังการผลิตไวนิลคอลไรด์โมโนเมอร์ บมจ.ไทยพลาสติกและเคมีภัณฑ์ โดยศาลให้คณะกรรมการสิงแวดล้อมไปพิจารณาว่าเข้าข่ายโครงการที่มีผลกระทบรุนแรงหรือไม่"},{"date":"6 กย. 2553","incident":"คณะกรรมการ 4 ฝ่ายเปิดแถลงการณ์ถึงกรณีที่รัฐบาลตัดประเภทกิจการที่อาจก่อให้เกิดผลกระทบที่รุนแรงทั้งทางคุณภาพสิ่งแวดล้อมทรัพยากรธรรมชาติและสุขภาพจากที่เสนอไป 18 ประเภท\nเหลือเพียง 11 ประเภทโดยให้รัฐบาลชี้แจงเป็นลายลักษณ์อักษร"},{"date":"30 กย. 2553","incident":"กลุ่มเครือข่ายประชาชน รวมตัวกันเรียกร้องให้รัฐบาลทบทวนหรือยกเลิก 11 กิจการมาบตาพุดที่อาจก่อความรุนแรงมห้กับชุมชนคัดค้านยื่นฟ้องให้กลับมาพิจารณา 18 กิจการแทน แต่รัฐบาล\nไม่ทบทวน"},{"date":"22 พย. 2553","incident":"นายกรัฐมนตรีลงพื้นที่มาบตาพุด ทำแนวกันชน 46 จุด"}],"2554":[{"date":"11 มค. 2554","incident":"ที่ประชุมครม.มีมติอนุมัติแผนงานแก้ไขปัญหาเร่งด่วนของมาบตาพุด (เพิ่มเติม) ในวงเงิน 255 ล้านบาท เพื่อขยายเขตประปา ตรวจสุขภาพ และตั่งสถานีตรวจวัดคุณภาพอากาศ การดูแลเรื่องมลพิษและสิ่งแวดล้อมของชุมชนในเขตมาบตาพุด"},{"date":"กพ. 2554","incident":"บริษัทพิสุทธิ์ เทคโนโลยี เสนอรรายงานฉบับสุดท้าย ในโครงการจ้างที่ปรึกษาดำเนินการจัดทำปรับปรุงผังเมืองรวม บริเวณอุตสาหกรรมหลักและชุมชนจ.ระยอง(ปรับปรุงครั้งที่ 3) ต่อคณะที่ปรึกษาผังเมืองรวมฯ ที่มีผู้ว่าราชการจ.ระยองเป็นประธานให้พิจารณา โดยขณะนี้อยู่ระหว่างการสำรวจความคิดเห็นประชาชนในพื้นที่"},{"date":"9 กพ. 2554","incident":"การนิคมอุตสาหกรรมแห่งประเทศไทย(กนอ.)สำนักงานคณะกรรมการส่งเสริมการลงทุน(บีโอไอ)อยู่ระหว่างร่วมกันศึกษาแนวทางการกำหนดสิทธิประโยชน์ของอุตสาหกรรมเชิงนิเวศน์หรืออีโคทาวน์"}],"2555":[{"date":"18 มิย. 2555","incident":"ที่ประชุมคณะรัฐมนตรีมีมติเห็นชอบแผนการแก้ไขปัญหามาบตาพุดอย่างครบวงจร ระยะเวลา 5 ปี 2555-2559 ตามที่สำนักงานคณะกรรมการพัฒนาการเศรษฐกิจและสังคมแห่งชาติ (สศช.)\nเสนอ มีโครงการที่ต้องดำเนินงานกว่า 92 โครงการ วงเงินรวม 4,347 ล้านบาท"}]}
window['graph-Accident'+'List']=  _.collect(incidentMap, function(v, k) { return v })
window['graph-Event'+'List']=  _.collect(eventMap, function(v, k) { return v })
var pmList = {
    2523: {
        'fullname'    : 'พล.อ.เปรม ติณสูลานนท์',
        'hold_years': 'พศ.2523 - พศ.2529',
        'events'      : [
            { date: 'มีนาคม 2524', incident: 'ริเริ่มโครงการพัฒนาพื้นที่ชายฝั่งทะเลตะวันออกเฟสที่ 1 มีการมอบหมายให้สำนักผังเมืองดำเนินการวางผังเมืองรวมบริเวณอุตสาหกรรมหลังและชุมชนจังหวัดระยอง'},
            { date: 'พฤศจิกายน 2529', incident: 'ทำพิธีเปิดนิคมอุตสาหกรรมมาบตาพุด' }
        ]
    },
    2531: {
        'fullname'  : 'พล.อ.ชาติชาย ชุณหะวัณ',
        'hold_years': 'พศ.2531 - พศ.2534',
        'events'    : [
            { date: '2531', incident: 'ตั้งเป้าให้ไทยเป็นเสือตัวที่ 5 ขอเอเชีย ทำให้มีการขายพื้นที่นิคมอุตสาหกรรมออกไปจาก 8,000 ไร่เป็น 20,000 ไร่'},
            { date: '5 สิงหาคม 2531', incident: 'มีการประกาศใช้ผังเมืองมาบตาพุดปี 2531 พร้อมกับลงทุนก่อสร้างโรงงานปิโตรเคมีและพลาสติกเป็นจำนวนมาก' }
        ]
    },
    2534: {
        'fullname'  : 'นายอานันท์ ปันยารชุน',
        'hold_years': 'พศ.2534 - พศ.2535',
        'events'    : [
            { date: '21 พฤษภาคม 2534',  incident: 'ประกาศใช้ผังเมืองปีพ.ศ. 2534' }
        ]
    },
    2535: {
        'fullname'  : 'นายชวน หลีกภัย',
        'hold_years': 'พศ.2535 - พศ.2538',
        'events'    : [
            { date: 'พ.ศ. 2538', incident: 'วางแผนต่อเนื่องเข้าสู่แผนพัฒนาชายฝั่งทะเลตะวันออกเฟสที่ 2' }
        ]
    },
    2538: {
        'fullname'  : 'นายบรรหาร ศิลปอาชา',
        'hold_years': 'พศ.2538 - พศ.2539',
        'events'    : [
            { date: 'พ.ศ. 2539', incident: 'มีการสร้างโรงกลั่นน้ำมันในพื้นที่กันชนระหว่างอุตสาหกรรมและชุมชน' }
        ]
    },
    2539: {
        'fullname'  : 'พล.อ.ชวลิต ยงใจยุทธ',
        'hold_years': 'พศ.2539 - พศ.2540',
        'events'    : [
            { date: 'พ.ศ.2540', incident: 'เริ่มเกิดการร้องเรียนของชาวบ้าน ครู และนักเรียน จากปัญหามลพิษทางอากาศ' }
        ]
    },
    2540: {
        'fullname'  : 'นายชวน หลีกภัย (2)',
        'hold_years': 'พศ.2540 - พศ.2543',
        'events'    : [
            { date: 'มิถุนายน 2541', incident: 'เกิดผลกระทบจากมลพิษทางอากาศที่มาจากโรงกลั่นน้ำมันและโรงงานเคมีในนิคมอุตสาหกรรมมาบตาพุด ทำให้เด็กนักเรียนโรงเรียนมาบตพุดพันพิทยาคาร นับร้อยล้มป่วยจนต้องหามส่งโรงพยาบาล / หยุดโรงงานชั่วคราวจำนวน 6 โรงงาน ย้ายโรงเรียนให้ห่างจากที่ตั้งเดิม 5 กิโลเมตร คณะกรรมการสิ่งแวดล้อมแห่งชาติมีมติให้ประเมินศักยภาพการรับรองมลพิษของพื้นที่' }
        ]
    },
    2544: {
        'fullname'  : 'พ.ต.ท.ทักษิณ ชินวัตร',
        'hold_years': 'พศ.2544 - พศ.2549',
        'events'    : [
            { date: 'พ.ศ. 2544', incident: 'เข้าสู่แผนพัฒนาชายฝั่งทะเลตะวันออกเฟส 2 มีการขยายอุตสาหกรรมเข้าไปสู่พื้นที่ตอนใน โดยเฉพาะอำเภอปลวกแดง'},
            { date: '12พฤษภาคม 2546', incident: 'ประกาศใช้ผังเมืองปี 2546โดยขยายพื้นที่อุตสาหกรรมไปทับซ้อนกับหลายชุมชน และขยายไปสู่เขต อ. บ้านฉาง'},
            { date: 'กรกฎาคม 2546 ', incident: 'ก่อสร้างและดำเนินการโรงไฟฟ้าถ่านหินบีแอลซี'},
            { date: 'พ.ศ. 2548', incident: 'วางแผนแม่บทอุตสาหกรรมปิโตรเคมีเฟสที่ 3 / แก้ไขข้อกำหนดผังเมือง อ.บ้านฉางเพื่ออนุญาตอุตสาหกรรมปิโตรเคมีขั้นต้น / อนุมัติโครงการอุตสาหกรรมเคมี โรงไฟฟ้าและอิ่นๆ'},
            { date: 'กันยายน 2549', incident: 'กรมควบคุมมลพิษตรวจสอบพบสารอินทรีย์ระเหยก่อมะเร็ง 19 ชนิด มีค่าสูงกว่ามาตรฐานของสหรัฐอเมริกา'},
            { date: '2549', incident: 'เกิดภัยแล้งจากภาวะขาดแคลนน้ำในพื้นที่ ส่งผลให้เกิดการแย่งใช้น้ำระหว่างชุมชนกับภาคอุตสาหกรรม'},
            { date: '2549', incident: 'องค์กรเอกชนรณรงค์ให้รัฐบาลพิจารณาประกาศให้พื้นที่มาบตาพุดเป็นเขตควบคุมมลพิษ'},
            { date: '2549', incident: 'รัฐบาลไม่ประกาศเขตควบคุมมลพิษ แต่ให้การนิคมอุตสาหกรรมแห่งประเทศไทย (กนอ.) และผู้ประกอบการในนิคมฯ ว่าจ้างที่ปรึกษา เพื่อประเมินศักยภาพการรองรับมลพิษ ได้ข้อสรุปเบื้องต้นว่า พื้นที่มาบตาพุด ไม่สามารถรองรับอุตสาหกรรมได้อีกต่อไป' }
        ]
    },
    2549: {
        'fullname'  : 'พล.อ.สุรยุทธ์ จุลานนท์',
        'hold_years': 'พศ.2549 - พศ.2551',
        'events'    : [
            { date: '1 ตุลาคม 2550', incident: 'และชาวบ้านมาบตาพุดฟ้องคณะกรรมสิ่งแวดล้อมแห่งชาติต่อศาลปกครองระยองเพื่อให้ปฏิบัติหน้าที่ตาม พ.ร.บ.ส่งเสริมและรักษาคุณภาพสิ่งแวดล้อม พ.ศ.253มาตรา 59 คือประกาศให้พื้นที่มาบตาพุดและพื้นที่ใกล้เคียงเป็นเขตควบคุมมลพิษ' },
            { date: '11 มกราคม 2550', incident: 'คณะกรรมการสิ่งแวดล้อมฯ มีมติแต่งตั้งคณะอนุกรรมการเฉพาะกิจเพื่อแก้ไขปัญหามลพิษและกำหนดการ พัฒนาในพื้นที่จังหวัดระยองเพื่อจัดทำและกำกับแผนปฏิบัติการลดและขจัดมลพิษ ในพื้นที่จังหวัดระยอง' },
            { date: 'พ.ศ. 2550 – 2554', incident: 'กำหนดค่าเฝ้าระวังเฉลี่ยรายปีสารอินทรีย์ระเหยก่อมะเร็ง 9 ชนิด กระบวนการสมัชชาสุขภาพและการประเมินผลกระทบทางสุขภาพ'},
        ]
    },
    2551: {
        'fullname'  : 'นายอภิสิทธิ์ เวชชาชีวะ',
        'hold_years': 'พศ.2551 - พศ.2553',
        'events'    : [
            { date: '3 มีนาคม 2552', incident: 'ประกาศให้พื้นที่ตำบลมาบตาพุดและบริเวณใกล้เคียงเป็นเขตควบคุมมลพิษ' },
            { date: '29 กันยายน 2552', incident: 'ระงับโครงการพัฒนาพื้นที่ชายฝั่งทะเลตะวันออกเฟสที่ 3 ชั่วคราว ใน76 โครงการ เพื่อคุ้มครองชุมชนมาบตาพุดโดยศาลปกครอง' },
            { date: '13 พฤศจิกายน 2552', incident: 'รัฐบาลได้แต่งตั้งคณะกรรมการแก้ไขปัญหาการปฏิบัติตามมาตรา 67 วรรคสอง ของรัฐธรรมนูญแห่งราชอาณาจักรไทย (คณะกรรมการ 4 ฝ่าย) มีหน้าที่จัดทำข้อยุติเพื่อเสนอให้นายกรัฐมนตรีพิจารณาดำเนินการตามอำนาจหน้าที่ให้สอดคล้องกับบทบัญญัติรัฐธรรมนูญแห่งราชอาณาจักรไทย มาตรา 67 วรรคสอง' },
            { date: '1 ธันวาคม 2552', incident: 'การแก้ไขปัญหาเร่งด่วนของประชาชน และการลดและขจัดมลพิษในพื้นที่มาบตาพุดและบริเวณใกล้เคียง โดยหน่วยงานต่างๆ ได้รับอนุมัติจากคณะรัฐมนตรีให้ดำเนินโครงการมาโดยลำดับ 4 ครั้ง จำนวนรวม 32 โครงการ วงเงินรวม 1,432 ล้านบาท' },
            { date: '8 กรกฎาคม 2553', incident: 'จัดทำแผนปฏิบัติการเพื่อลดและขจัดมลพิษในเขตควบคุมมลพิษ จังหวัดระยอง พ.ศ. 2553-2556 ประกอบด้วย 7 แผนงาน 71 โครงการ วงเงินรวม 2,182 ล้านบาท' },
            { date: '1 ธันวาคม 2552', incident: 'การแก้ไขปัญหาเร่งด่วนของประชาชน และการลดและขจัดมลพิษในพื้นที่มาบตาพุดและบริเวณใกล้เคียง โดยหน่วยงานต่างๆ ได้รับอนุมัติจากคณะรัฐมนตรีให้ดำเนินโครงการมาโดยลำดับ 4 ครั้ง จำนวนรวม 32 โครงการ วงเงินรวม 1,432 ล้านบาท' }
        ]
    },
    2553: {
        'fullname'  : 'น.ส.ยิ่งลักษณ์ ชินวัตร',
        'hold_years': 'พศ.2553 - ปัจจุบัน',
        'events'    : [
            { date: '4 เมษายน 2554', incident: 'ที่ประชุมครม. มีมติเห็นชอบแผนการแก้ไขปัญหามาบตาพุดอย่างครบวงจร ระยะเวลา 5 ปี 2555-2559 ตามที่สำนักงานคณะกรรมการพัฒนาการเศรษฐกิจและสังคมแห่งชาติ (สศช.)เสนอ มีโครงการที่ต้องดำเนินงานกว่า 92 โครงการ วงเงินรวม 4,347 ล้านบาท' }
        ]
    },
};

window.buildincidentHTML = function(idx, type) {
    console.log(idx, type)
    var html = _.template("<div class='event-<%= type %>'><ul id='incident-<%= type %>'>")({type: type});
    var make_li = _.template(" <li>\
                                    <div class='time'><%= date %></div>\
                                    <div class='incident'> <%= incident %> </div>\
                                    <div clss='detail'>\
                                    <% if (type=='graph-Accident') { %> \
                                        <span>สถานที่</span> <%= location %>\
                                        <span>ผลกระทบ</span> <%= effect %>\
                                    <% } %>\
                                    </div>\
                                </li>")
    var obj = window[type + 'List']

    if (!_.isUndefined(obj)) {
        _.each(obj[idx], function(v, k) {
            _.extend(v, {type: type})
            html += make_li(v)
        })
    }

    html += "</ul></div>"
    return  html;
}

$(document).ready(function() {
    var svgprime = $('#svgprime').svg()
        svgprime.load('PrimeMinister.svg?'+Math.random(), 'get', function (svg) {
            // ON PRIMINISTER CLICK
            $('image[id$="primeMinister"]').
            mouseover(function(e) {
                $(this).css({ cursor: 'pointer'});

                var pmId = $(this).attr('id').split('-')[0],
                    pmFullname = pmList[pmId] ? pmList[pmId]['fullname'] : ''
                ;
                $(this).tipsy({
                    className: 'prime-minister-tipsy',
                    gravity: 'n',
                    fallback: pmFullname
                })
                .tipsy("show");
            }).
            click(function(){
                var pmId = $(this).attr('id').split('-')[0];
                $.colorbox({
                    html        :buildPMInfo(pmId),
                    width       :"600px",
                    opacity     :0.82,
                    height      : "75%"
                });
            });
        })

    var svggraph = $('#svggraph').svg()
    svggraph.load('graph.svg?'+Math.random(), 'get', function (svg) {
        var data = $('svg > g', $('#svggraph'))
        window.activeLayers2 = []

        window.gr2 = _.groupBy(data, function(i) {
            return i.id.split('_')[0] || 'other'
        })

        // CREATE LAYER MANAGER
        window.LayerManager2 = CreateLayerManager(gr2, activeLayers2) // LAYER MANAGER
        LayerManager2.show('graph', ['Factory', 'Accident', 'Event', 'GPP'])

        // BIND EVENT
        bindEvent(LayerManager2.funcs['graph-Factory'].data(), jQuery('[id$="factoryBubble"]'))
        bindEvent(LayerManager2.funcs['graph-GPP'].data(), jQuery('[id$="gppBubble"]'))
        bindEvent(LayerManager2.funcs['graph-Accident'].data(), jQuery('[id$="accidentBubble"]'))
        bindEvent(LayerManager2.funcs['graph-Event'].data(), jQuery('[id$="event"]'))

    })
    function buildPMInfo(year) {
        var pm = pmList[year];
        var events_html = "<ul>";
        var events_template = _.template("<li><div class='time'><%= date %></div> <div class='data-year'><%= incident %></div> </li>")
        _.each(pm['events'], function(data) {
	        events_html += events_template(data)
        })
        events_html += "</ul>";

        var template = _.template("<div class='primebox'> \
																        <img src='asset/primeminister/<%= year %>-primeMinister.png'/> \
                                        <div class='fullname'> \
                                            <%= fullname %> \
                                        </div> \
                                        <div class='holdyear'> <%= hold_years %> </div> \
                                        <p class='events'>  <%= events_html %> </p> \
                                    </div>");
        var data = { fullname: pm.fullname, hold_years: pm.hold_years,
            year: year, events_html: events_html
        }
        return  template(data);
    }

    function bindEvent(data, bubble) {
        var bindBubble = function(v, idx) {
            var t1;
            var type;
            $(v).mouseenter(function(e) {
                t1 = new Date();
                var $this = $(this);
                var $parent = $this.parent();
                if (_.isUndefined($parent.attr('id'))) {
                    $this.css({'opacity': 1.0, 'cursor': 'pointer'});
                    type = $this.parent().parent().parent().attr('id');
                }
                bubble.hide();
                e.stopPropagation();
                bubble.eq(idx).fadeIn();
            })
            .click(function(e) {
                $parent = $(this).parent();
                if (_.isUndefined($parent.attr('id'))) {
                    $.colorbox({
                        html        : buildincidentHTML(idx, type),
                        width       : "600px",
                        opacity     : 0.82,
                        height      : "75%"
                    });
                }

            })
            .mouseleave(function(e){
                var t2 = new Date();
                var diff = t2 - t1;
                if (diff>80) {
                    setTimeout(function() {
                        bubble.eq(idx).fadeOut()
                    }, 200)

                }
                else {
                   setTimeout(function() {
                        bubble.eq(idx).fadeOut();
                    }, 300);
                }
            })
        }

        var circle = $('circle', data);
        _.each(circle, function(v, idx) {
            bubble.eq(idx).click(function(e) {
                console.log($(this));
            })
            bindBubble(v, idx);
        })
    }
})