window.incedentMap = {"2530":[{"date":"2530","incedent":"เพลิงลุกไหม้จากการรั่วไหลของเอทิลีน (Ethylene)","location":"Thai Petrochemical Industry Ltd. (TPI) จ.ระยอง","location":"ไม่มีรายงานความเสียหาย"}],"2538":[{"date":"2538","incedent":"เพลิงลุกไหม้จากการรั่วไหลของเอทิลีน (Ethylene)","location":"Thai Petrochemical Industry Ltd. (TPI) จ.ระยอง","location":"ไม่มีรายงานความเสียหาย"}],"2542":[{"date":"'6/12/2542","incedent":"รถบรรทุกกรดไฮโดรคลอริก 35% ขนาด 11 ตัน ของบริษัทซีแอลทราน สปอร์ต จำกัด ระเบิดและรั่วไหล เกิดควันของไอกรดฟุ้งกระจาย","location":"ถนนสาย 3138 (ระยอง-บ้านค่าย) อ.เมือง จ.ระยอง","location":"มีผู้เจ็บป่วยจากการสูดดมก๊าซไฮโดรคลอริก 5 ราย"}],"2543":[{"date":"'3/6/2543","incedent":"ท่อส่งก๊าซคาร์บอนิลคลอไรด์ (ฟอสจีน) เกิดการแตกรั่ว","location":"บริษัทไทยโพลีคาร์บอเนต จำกัด นิคมอุตสาหกรรมผาแดง อ.เมือง จ.ระยอง","location":"ประชาชนได้รับอันตรายจากการสูดดมก๊าซพิษจำนวนมาก เสียชีวิต 1 คน "},{"date":"'6/18/2543","incedent":"รถบรรทุก 10 ล้อ ขนโซดาไฟ พลิกคว่ำลงคลอง ทำให้โซดาไฟที่บรรจุในถุงละลายไปกับน้ำ","location":"ทางหลวงในเขต กิ่ง อ.พนัสนิคม จ.ระยอง","location":"คนขับรถเสียชีวิต 1 คนโซดาไฟแพร่กระจายเป็นระยะทาง 8 กม. ทำให้ปลาตายจำนวนมาก"},{"date":"'11/23/2543","incedent":"รถขนกรดซัลฟูริก 98% ความจุ 12 ตัน พุ่งชนรถคันอื่น ทำให้กรด ซัลฟูริกไหลลงคลองข้างทาง","location":"ต.มาบตาพุด อ.เมือง จ.ระยอง","location":"บาดเจ็บ 2 ราย"}],"2544":[{"date":"'1/1/2544","incedent":"เรือบรรทุกแอมโมเนียมไนเตรทปริมาณ 125 ตู้คอนเทนเนอร์ล่มขณะขนย้ายสินค้าลงเรือ","location":"ท่าเทียบเรือ บ.อุตสาหกรรมปิโตรเคมีกัลไทย จำกัด จ.ระยอง","location":"ปลาตายจากสารเคมีรั่วไหล"},{"date":"'3/4/2544","incedent":"รถบรรทุกเทรเลอร์บรรทุกโซดาไฟพลิกตะแคงในซอยเข้าหมู่บ้านตะกาด หมู่ 4 ต.ตะพง อ.เมือง จ.ระยอง สารเคมีไหลลงสู่แหล่งน้ำ","location":"อ.เมือง จ.ระยอง","location":"สารเคมีไหลลงสู่แหล่งน้ำกินของสัตว์เลี้ยงบริเวณทุ่งนา และมีปลาตายจำนวนมาก"},{"date":"'3/5/2544","incedent":"รถบรรทุกสารเคมีซีโฟร์พลิกคว่ำขณะนำส่งสารเคมีที่บริษัทอุตสาหกรรมปิโตรเคมีกัลไทย จำกัด","location":"นิคมอุตสาหกรรมมาบตาพุด อ.เมือง จ.ระยอง","location":"ไม่มีรายงานความเสียหาย"},{"date":"'3/6/2544","incedent":"รถบรรทุกของบริษัทเซออนเคมิคอล ซึ่งบรรทุกสาร Butadiene Raffinate จำนวน 16 ตัน พลิกคว่ำ","location":"นิคมอุตสาหกรรมมาบตาพุด อ.เมือง จ.ระยอง","location":"ไม่มีรายงานความเสียหาย"},{"date":"'3/7/2544","incedent":"รถบรรทุกสารเคมีพลิกคว่ำ  ทำให้สารเคมีซึ่งคาดว่าเป็นแคลเซียมออกไซด์ (CaO) หกหล่นและถูกทิ้งไว้ในบริเวณนั้น","location":"บ้านตะกาด หมู่ 4 ต.ตะพง อ.เมือง จ.ระยอง","location":"ส่งผลกระทบต่อดินและหญ้าในบริเวณดังกล่าว ทำให้ดินมีสีจางลง และหญ้าตาย"},{"date":"'6/18/2544","incedent":"รถบรรทุกกรดไฮโดรคลอริก 35% ขนาด 11 ตันของบริษัทซีแอลทราน สปอร์ต จำกัด ระเบิดและรั่วไหล ","location":"ถนนสาย 3138 (ระยอง-บ้านค่าย) อ.เมือง จ.ระยอง","location":"กรดไฮโดรคลอริกรั่วไหลลงพื้นถนนเป็นระยะทาง 25 กม. มีผู้เจ็บป่วยจากการสูดดมกรด 5 ราย"}],"2545":[{"date":"'4/10/2545","incedent":"เกิดการระเบิดของสารเคมีในถังผสมสาร (ไนโตรเซลลูโลส และสารไวไฟหลายชนิด)","location":"บริษัทไทยโดโน-เกนเกน จำกัดกิ่ง อ.นิคมพัฒนา จ.ระยอง","location":"อาคารผลิตเสียหายทั้งหลัง มูลค่าความเสียหาย50 ล้านบาท และเกิดก๊าซพิษ"},{"date":"'4/13/2545","incedent":"ไฟไหม้โรงงานผลิตพลาสติก","location":"บริษัทเอสทีดี พรีซีซัน จำกัด อ.บ้านฉาง จ.ระยอง","location":"ความเสียหายมากกว่า 60 ล้านบาท"},{"date":"'5/3/2545","incedent":"รถบรรทุกสาร White Oil ของบริษัท S&R Transport ประสบอุบัติเหตุชนกับรถกระบะ ทำให้สารเคมีรั่วไหลลงสู่พื้นถนน","location":"ถนน By-pass สาย 36 กิ่ง อ.นิคมพัฒนา จ.ระยอง","location":"กลิ่นจากไอระเหยของสาร ทำให้เกิดการระคายเคืองตา ผิวหนัง และระบบทางเดินหายใจ"},{"date":"'6/25/2545","incedent":"เกิดเหตุระเบิดที่โรงงานบรรจุก๊าซ ขณะคนงานถ่ายก๊าซจากถังใหญ่ลงถังเล็ก","location":"ห้างหุ้นส่วนจำกัด ไทยผลิตภัณฑ์ก๊าซ ต.เนินพระ อ.เมือง จ.ระยอง","location":"โรงงานได้รับความเสียหาย คนงานเสียชีวิต 1 ราย และได้รับบาดเจ็บ 1 ราย"},{"date":"'12/11/2545","incedent":"โรงงานอุตสาหกรรมลักลอบนำน้ำกรดมาทิ้ง","location":"ชุมชนบ้านชากกลาง หมู่ 4 ต.ห้วยโป่ง อ.เมือง จ.ระยอง","location":"น้ำในคลองเน่าเสีย  เมื่อถูกตามร่างกายจะคันและแสบมาก"}],"2547":[{"date":"'12/3/2547","incedent":"เพลิงไหม้โกดังเก็บวัตถุดิบสำหรับผลิตพีวีซีหรือพลาสติกแผ่นแข็ง","location":"โรงงานซีพีเจริญโภคภัณฑ์ปิโตรเคมี จำกัด กิ่งอำเภอนิคมพัฒนา จ.ระยอง","location":"เพลิงใหม้กว่า 2 ชั่วโมง สูญเสียไม่ต่ำกว่า 100 ล้านบาท"}],"2548":[{"date":"'9/20/2548","incedent":"แอมโมเนียรั่วออกมาจากท่อส่งที่ผุกร่อน","location":"โรงงานแปรรูปอาหารทะเลบริษัท เจริญโภคภัณฑ์อาหาร จำกัด จ.ระยอง","location":"ไม่มีรายงานความเสียหาย"},{"date":"'9/22/2548","incedent":"เพลิงไหม้ถังน้ำมันเตาและน้ำมันดีเซล","location":"บริษัท มิยูกิ อินดัสทรี (ประเทศไทย) จำกัด นิคมอุตสาหกรรมสยามอิสเทิร์น","location":"น้ำมันเตาและน้ำมันดีเซลไหม้ไฟไปอย่างละประมาณ 3 หมื่นลิตร"}],"2549":[{"date":"'5/4/2549","incedent":"น้ำมันเตารั่วไหลลงทะเล ขณะกำลังขนถ่ายจากคลังน้ำมันลงเรือ CT 34 ประเทศไทย","location":"ท่าเรือโรงกลั่นน้ำมัน บริษัท อัลลายแอนซ์ รีไฟน์นิ่ง จำกัด นิคมอุตสาหกรรมมาบตาพุต อ. เมือง จ. ระยอง","location":"น้ำมันเตารั่วไหลลงทะเลประมาณ 15,000 ลิตร"},{"date":"'11/3/2549","incedent":"รถบรรทุกสารแมททิวลีน บรรจุถัง 200 ลิตร จำนวน 4 ถัง และสารเคมีทินเนอร์ บรรจุถัง 20 ลิตร จำนวน 7 ถัง พลิกคว่jeเกิดไฟลุกไหม้ทั้งคัน","location":"ถนนสาย 36 กม.31 หมู่ 6 ต.มะขามคู่ อ.นิคมพัฒนา จ.ระยอง","location":"มีผู้บาดเจ็บเล็กน้อย 1 ราย"},{"date":"'11/16/2549","incedent":"คนงานใช้รถแบ็คโฮผสมขยะในบ่อปรับเสถียรและเติมสารเคมีลงไป ทำให้เกิดประกายไฟลุกใหม้กองขยะ","location":"บริษัทบริหารและพัฒนาเพื่อการอนุรักษ์สิ่งแวดล้อม จำกัด (มหาชน) ถ.ไอ2 นิคมอุตสาหกรรมมาบตาพุด จ.ระยอง","location":"ไม่มีรายงานความเสียหาย"},{"date":"'12/5/2549","incedent":"มีการรั่วไหลของสารระเหยอินทรีย์หลายชนิด โดยเฉพาะสารไฮโดรปิโตรเลียม จากถังเก็บสารเคมีในบริเวณปั้มน้ำมัน","location":"ปั๊มน้ำมัน ตันติชัย จำกัด ริมถนนสุขุมวิทเลขที่ 227/10 หมู่ 6 ริมถนนสุขุมวิท ต.ทุ่งควายกิน อ.แกลง จ.ระยอง","location":"ประชาชนบริเวณรอบ 300 เมตรสูดดมสารเคมีเกิดการอาเจียน หน้ามืด วิงเวียน และหมดสติ"}],"2550":[{"date":"'1/2/2550","incedent":"ไฟไหม้โรงงานเก็บเม็ดพลาสติก","location":"บริษัท จิ้งฮงระยอง จำกัด 81/4 ถนนสายบายพาส 36 ต.เชิงเนิน อ.เมือง จ.ระยอง","location":"ไม่มีรายงานความเสียหาย"},{"date":"'1/9/2550","incedent":"ไฟไหม้ถังเก็บสารเอทธิลีน ภายในแทงก์ฟาร์มของโรงงานบริษัท ไออาร์พีซี (ทีพีไอ)","location":"โรงงานบริษัท ไออาร์พีซี (ทีพีไอ) ต. เชิงเนิน อ. เมืองระยอง","location":"เพลิงไหม้ถังเก็บสารเอทธิลีน 1 ลูก"},{"date":"'2/18/2550","incedent":"เกิดไฟไหม้ที่เครื่องยนต์ ภายในรถบรรทุกเม็ดพลาสติกกว่า 1,000 ตัน","location":"บริเวณถนนบายพาสระยอง-กระทิงลาย ต.มะขามคู่ กิ่ง อ.นิคมพัฒนา จ. ระยอง","location":"มูลค่าความเสียหายกว่า 1 ล้านบาท"},{"date":"'8/27/2550","incedent":"ลักลอบทิ้งกากของเสียจากโรงงานอุตสาหกรรม","location":"บริเวณป่าริมถนนสายบายพาส 36 ระหว่างหลักกิโลเมตร 35-36 เขตเทศบาลเมืองมาบตาพุด จ.ระยอง","location":"ส่งกลิ่นเหม็นรุนแรงไปทั่วบริเวณ"}],"2551":[{"date":"'2/6/2551","incedent":"มีการลักลอบทิ้งสารเคมี ลักษณะสีขาวข้นจำนวนมาก","location":"ภายในซอยกอไผ่ ต.เนินพระ เขตเทศบาลเมืองมาบตาพุด จ.ระยอง","location":"บาดเจ็บ 4 ราย มีอาการเจ็บคอ หายใจไม่สะดวก เวียนศีรษะ อ่อนเพลีย มีผื่นและแสบผิวหนัง"},{"date":"'6/10/2551","incedent":"ท่อส่งสารคิวมีน (Cumene) ขนาด 6 นิ้ว รั่วไหล ทำให้ก๊าซพิษกระจายไปทั่วโรงงาน","location":"บริษัท พีทีที ฟีนอล จำกัด นิคมอุตสาหกรรมเหมราช  ถนนปกรณ์สงเคราะห์ ต.ห้วยโป่ง อ.เมือง จ.ระยอง","location":"มีผู้ได้รับบาดเจ็บจากการสูดดมก๊าซพิษทั้งสิ้น 112 ราย ในจำนวนนี้มีอาการสาหัส 33 ราย"},{"date":"'9/6/2551","incedent":"ลักลอบทิ้งกากของเสียอุตสาหกรรม ลักษณะเป็นก้อนสีดำจำนวนมาก","location":"ริมถนนสาย 36 หมู่ 2 ต.เชิงเนิน จ.ระยอง","location":"ส่งกลิ่นเหม็น ฟุ้งกระจายไปทั่วบริเวณ"}],"2552":[{"date":"'1/31/2552","incedent":"น้ำมันจำนวนมากรั่วไหลออกมาจากเรือบรรทุกน้ำมัน กระจายลงทะเลเป็นบริเวณกว้าง","location":"บริเวณชายหาดแหลมรุ่งเรือง ใกล้กับท่าเทียบเรือของ บริษัท ไออาร์พีซี จำกัด (มหาชน) จ. ระยอง","location":"คราบน้ำมันแผ่ครอบคลุมพื้นที่เป็นบริเวณกว้าง และถูกคลื่นลมพัดเข้าสู่ชายฝั่งทะเล"},{"date":"'2/13/2552","incedent":"ก๊าซไฮโดรเจนซัลไฟด์รั่วไหล ","location":"บริษัท ปตท. เคมีคอล จำกัด (มหาชน) ถนนไอ นิคมอุตสาหกรรมมาบตาพุด ต.ห้วยโป่ง อ.เมือง จ.ระยอง","location":"คนงานและผู้รับเหมาจำนวน 27 ราย มีอาการวิงเวียนศีรษะ แน่นหน้าอก หายใจไม่ออก มี 4 รายอาการสาหัส"},{"date":"'3/2/2552","incedent":"มีการลักลอบนำขยะสารเคมีจากโรงงานผลิตเม็ดพลาสติกมาทิ้ง","location":"พื้นที่รกร้างริมคลองน้ำหูคลองสาธารณะ เขตเทศบาลเมืองมาบตาพุด จ.ระยอง","location":"กากขยะสารเคมีส่งกลิ่นเหม็นฉุนรุนแรงทั่วบริเวณ"},{"date":"'5/7/2552","incedent":"ไฟไหม้บริเวณบ่อน้ำมันออแกไนซ์จำนวน 7 บ่อ ภายในโรงงานหลอมเหล็ก","location":"บริษัท ไทยคูน เวิลด์ไวด์กรุ๊ป (ประเทศไทย) จำกัด 99 ม.1 นิคมอุตสาหกรรมระยอง อ.นิคมพัฒนา จ.ระยอง","location":"ไม่มีรายงานความเสียหาย"}],"2555":[{"date":"'5/5/2555","incedent":"เหตุเพลิงไหม้โรงงานของบริษัท บีเอสที อิลาสโตเมอร์ส จำกัด ในเครือบริษัท กรุงเทพ ซินธิติกส์ จำกัด   ","location":"นิคมอุตสาหกรรมมาบตาพุด อ.เมือง จ.ระยอง","location":"มีผู้เสียชีวิต 11 คนและบาดเจ็บ 181 คน"}]}
window['graph-Accident'+'List']=  _.collect(incedentMap, function(v, k) { return v })
var pmList = {
    2523: {
        'fullname'    : 'พล.อ.เปรม ติณสูลานนท์',
        'hold_years': 'พศ.2523 - พศ.2529',
        'events'      : [
            'มีนาคม 2524 - ริเริ่มโครงการพัฒนาพื้นที่ชายฝั่งทะเลตะวันออกเฟสที่ 1 มีการมอบหมายให้สำนักผังเมืองดำเนินการวางผังเมืองรวมบริเวณอุตสาหกรรมหลังและชุมชนจังหวัดระยอง',
            'พฤศจิกายน 2529 ทำพิธีเปิดนิคมอุตสาหกรรมมาบตาพุด'
        ]
    },
    2531: {
        'fullname'  : 'พล.อ.ชาติชาย ชุณหะวัณ',
        'hold_years': 'พศ.2531 - พศ.2534',
        'events'    : [
            'ตั้งเป้าให้ไทยเป็นเสือตัวที่ 5 ขอเอเชีย ทำให้มีการขายพื้นที่นิคมอุตสาหกรรมออกไปจาก 8,000 ไร่เป็น 20,000 ไร่',
            '5 สิงหาคม 2531 มีการประกาศใช้ผังเมืองมาบตาพุดปี 2531 พร้อมกับลงทุนก่อสร้างโรงงานปิโตรเคมีและพลาสติกเป็นจำนวนมาก'
        ]
    },
    2534: {
        'fullname'  : 'นายอานันท์ ปันยารชุน',
        'hold_years': 'พศ.2534 - พศ.2535',
        'events'    : [
            '21 พฤษภาคม 2534 ประกาศใช้ผังเมืองปีพ.ศ. 2534'
        ]
    },
    2535: {
        'fullname'  : 'นายชวน หลีกภัย',
        'hold_years': 'พศ.2535 - พศ.2538',
        'events'    : [
            'พ.ศ. 2538 วางแผนต่อเนื่องเข้าสู่แผนพัฒนาชายฝั่งทะเลตะวันออกเฟสที่ 2'
        ]
    },
    2538: {
        'fullname'  : 'นายบรรหาร ศิลปอาชา',
        'hold_years': 'พศ.2538 - พศ.2539',
        'events'    : [
            'พ.ศ. 2539 มีการสร้างโรงกลั่นน้ำมันในพื้นที่กันชนระหว่างอุตสาหกรรมและชุมชน'
        ]
    },
    2539: {
        'fullname'  : 'พล.อ.ชวลิต ยงใจยุทธ',
        'hold_years': 'พศ.2539 - พศ.2540',
        'events'    : [
            'พ.ศ.2540 เริ่มเกิดการร้องเรียนของชาวบ้าน ครู และนักเรียน จากปัญหามลพิษทางอากาศ'
        ]
    },
    2540: {
        'fullname'  : 'นายชวน หลีกภัย (2)',
        'hold_years': 'พศ.2540 - พศ.2543',
        'events'    : [
            'มิถุนายน 2541 เกิดผลกระทบจากมลพิษทางอากาศที่มาจากโรงกลั่นน้ำมันและโรงงานเคมีในนิคมอุตสาหกรรมมาบตาพุด ทำให้เด็กนักเรียนโรงเรียนมาบตพุดพันพิทยาคาร นับร้อยล้มป่วยจนต้องหามส่งโรงพยาบาล / หยุดโรงงานชั่วคราวจำนวน 6 โรงงาน ย้ายโรงเรียนให้ห่างจากที่ตั้งเดิม 5 กิโลเมตร คณะกรรมการสิ่งแวดล้อมแห่งชาติมีมติให้ประเมินศักยภาพการรับรองมลพิษของพื้นที่'
        ]
    },
    2544: {
        'fullname'  : 'พ.ต.ท.ทักษิณ ชินวัตร',
        'hold_years': 'พศ.2544 - พศ.2549',
        'events'    : [
            'พ.ศ. 2544 เข้าสู่แผนพัฒนาชายฝั่งทะเลตะวันออกเฟส 2 มีการขยายอุตสาหกรรมเข้าไปสู่พื้นที่ตอนใน โดยเฉพาะอำเภอปลวกแดง',
            '12พฤษภาคม 2546  ประกาศใช้ผังเมืองปี 2546โดยขยายพื้นที่อุตสาหกรรมไปทับซ้อนกับหลายชุมชน และขยายไปสู่เขต อ. บ้านฉาง',
            'กรกฎาคม 2546 ก่อสร้างและดำเนินการโรงไฟฟ้าถ่านหินบีแอลซี',
            'พ.ศ. 2548 วางแผนแม่บทอุตสาหกรรมปิโตรเคมีเฟสที่ 3 / แก้ไขข้อกำหนดผังเมือง อ.บ้านฉางเพื่ออนุญาตอุตสาหกรรมปิโตรเคมีขั้นต้น / อนุมัติโครงการอุตสาหกรรมเคมี โรงไฟฟ้าและอิ่นๆ',
            'กันยายน 2549 กรมควบคุมมลพิษตรวจสอบพบสารอินทรีย์ระเหยก่อมะเร็ง 19 ชนิด มีค่าสูงกว่ามาตรฐานของสหรัฐอเมริกา',
            'เกิดภัยแล้งจากภาวะขาดแคลนน้ำในพื้นที่ ส่งผลให้เกิดการแย่งใช้น้ำระหว่างชุมชนกับภาคอุตสาหกรรม',
            'องค์กรเอกชนรณรงค์ให้รัฐบาลพิจารณาประกาศให้พื้นที่มาบตาพุดเป็นเขตควบคุมมลพิษ',
            'รัฐบาลไม่ประกาศเขตควบคุมมลพิษ แต่ให้การนิคมอุตสาหกรรมแห่งประเทศไทย (กนอ.) และผู้ประกอบการในนิคมฯ ว่าจ้างที่ปรึกษา เพื่อประเมินศักยภาพการรองรับมลพิษ ได้ข้อสรุปเบื้องต้นว่า พื้นที่มาบตาพุด ไม่สามารถรองรับอุตสาหกรรมได้อีกต่อไป'
        ]
    },
    2549: {
        'fullname'  : 'พล.อ.สุรยุทธ์ จุลานนท์',
        'hold_years': 'พศ.2549 - พศ.2551',
        'events'    : [
            '1 ตุลาคม 2550 และชาวบ้านมาบตาพุดฟ้องคณะกรรมสิ่งแวดล้อมแห่งชาติต่อศาลปกครองระยองเพื่อให้ปฏิบัติหน้าที่ตาม พ.ร.บ.ส่งเสริมและรักษาคุณภาพสิ่งแวดล้อม พ.ศ.253มาตรา 59 คือประกาศให้พื้นที่มาบตาพุดและพื้นที่ใกล้เคียงเป็นเขตควบคุมมลพิษ',
            '11 มกราคม 2550 คณะกรรมการสิ่งแวดล้อมฯ มีมติแต่งตั้งคณะอนุกรรมการเฉพาะกิจเพื่อแก้ไขปัญหามลพิษและกำหนดการ พัฒนาในพื้นที่จังหวัดระยองเพื่อจัดทำและกำกับแผนปฏิบัติการลดและขจัดมลพิษ ในพื้นที่จังหวัดระยอง',
            'พ.ศ. 2550 – 2554 กำหนดค่าเฝ้าระวังเฉลี่ยรายปีสารอินทรีย์ระเหยก่อมะเร็ง 9 ชนิด กระบวนการสมัชชาสุขภาพและการประเมินผลกระทบทางสุขภาพ'
        ]
    },
    2551: {
        'fullname'  : 'นายอภิสิทธิ์ เวชชาชีวะ',
        'hold_years': 'พศ.2551 - พศ.2553',
        'events'    : [
            '3 มีนาคม 2552 ประกาศให้พื้นที่ตำบลมาบตาพุดและบริเวณใกล้เคียงเป็นเขตควบคุมมลพิษ',
            '29 กันยายน 2552 ระงับโครงการพัฒนาพื้นที่ชายฝั่งทะเลตะวันออกเฟสที่ 3 ชั่วคราว ใน76 โครงการ เพื่อคุ้มครองชุมชนมาบตาพุดโดยศาลปกครอง',
            '13 พฤศจิกายน 2552 รัฐบาลได้แต่งตั้งคณะกรรมการแก้ไขปัญหาการปฏิบัติตามมาตรา 67 วรรคสอง ของรัฐธรรมนูญแห่งราชอาณาจักรไทย (คณะกรรมการ 4 ฝ่าย) มีหน้าที่จัดทำข้อยุติเพื่อเสนอให้นายกรัฐมนตรีพิจารณาดำเนินการตามอำนาจหน้าที่ให้สอดคล้องกับบทบัญญัติรัฐธรรมนูญแห่งราชอาณาจักรไทย มาตรา 67 วรรคสอง',
            '1 ธันวาคม 2552 การแก้ไขปัญหาเร่งด่วนของประชาชน และการลดและขจัดมลพิษในพื้นที่มาบตาพุดและบริเวณใกล้เคียง โดยหน่วยงานต่างๆ ได้รับอนุมัติจากคณะรัฐมนตรีให้ดำเนินโครงการมาโดยลำดับ 4 ครั้ง จำนวนรวม 32 โครงการ วงเงินรวม 1,432 ล้านบาท',
            '8 กรกฎาคม 2553 จัดทำแผนปฏิบัติการเพื่อลดและขจัดมลพิษในเขตควบคุมมลพิษ จังหวัดระยอง พ.ศ. 2553-2556 ประกอบด้วย 7 แผนงาน 71 โครงการ วงเงินรวม 2,182 ล้านบาท',
            '1 ธันวาคม 2552 การแก้ไขปัญหาเร่งด่วนของประชาชน และการลดและขจัดมลพิษในพื้นที่มาบตาพุดและบริเวณใกล้เคียง โดยหน่วยงานต่างๆ ได้รับอนุมัติจากคณะรัฐมนตรีให้ดำเนินโครงการมาโดยลำดับ 4 ครั้ง จำนวนรวม 32 โครงการ วงเงินรวม 1,432 ล้านบาท'
        ]
    },
    2553: {
        'fullname'  : 'น.ส.ยิ่งลักษณ์ ชินวัตร',
        'hold_years': 'พศ.2553 - ปัจจุบัน',
        'events'    : [
            '4 เมษายน 2554 ที่ประชุมครม. มีมติเห็นชอบแผนการแก้ไขปัญหามาบตาพุดอย่างครบวงจร ระยะเวลา 5 ปี 2555-2559 ตามที่สำนักงานคณะกรรมการพัฒนาการเศรษฐกิจและสังคมแห่งชาติ (สศช.)เสนอ มีโครงการที่ต้องดำเนินงานกว่า 92 โครงการ วงเงินรวม 4,347 ล้านบาท'
        ]
    },
};

window.buildIncedentHTML = function(idx, type) {
    console.log(idx, type)
    var compiled = _.template("<div>INCEDENT: <%= incedent %> </div>");
    var html = "";
    var name = type + 'List';
    var obj = window[name]
    if (!_.isUndefined(obj)) {
        _.each(obj[idx], function(v, k) {
            html += compiled(v)
        })
    }


    return  html;
}

$(document).ready(function() {
    var svgprime = $('#svgprime').svg()
        svgprime.load('PrimeMinister.svg?'+Math.random(), 'get', function (svg) {
            // ON PRIMINISTER CLICK
            $('image[id$="primeMinister"]').
            mouseover(function(e) {
                $(this).css({ cursor: 'pointer'})
            }).
            click(function(){
                var pmId = $(this).attr('id').split('-')[0];
                $.colorbox({
                    html        :buildPMInfo(pmId),
                    width       :"600px",
                    opacity     :0.82,
                });
            });
        })

    var svggraph = $('#svggraph').svg()
    svggraph.load('graph.svg?'+Math.random(), 'get', function (svg) {
        var data = $('svg > g', $('#svggraph'))
        window.activeLayers2 = []

        window.gr2 = _.groupBy(data, function(i) {
            return i.id.split('_')[0] || 'other'
        })

        // CREATE LAYER MANAGER
        window.LayerManager2 = CreateLayerManager(gr2, activeLayers2) // LAYER MANAGER
        LayerManager2.show('graph', ['Factory', 'Accident', 'Event', 'GPP'])

        // BIND EVENT
        bindEvent(LayerManager2.funcs['graph-Factory'].data(), jQuery('[id$="factoryBubble"]'))
        bindEvent(LayerManager2.funcs['graph-GPP'].data(), jQuery('[id$="gppBubble"]'))
        bindEvent(LayerManager2.funcs['graph-Accident'].data(), jQuery('[id$="accidentBubble"]'))
        bindEvent(LayerManager2.funcs['graph-Event'].data(), jQuery('[id$="event"]'))

    })
    function buildPMInfo(year) {
        var pm = pmList[year];
        var events_html = "<ul>";
        _.each(pm['events'], function(data) {
            events_html += '<li>' + data + '</li>';
        })
        events_html += "</ul>";
        return "<div class='primebox'><p class='fullname'><img src='asset/primeminister/" + year + "-primeMinister.png'/>" + pm['fullname'] + "</p><p class='holdyear'>" + pm['hold_years'] + "</p><p class='events'>" + events_html + "</p></div>";
    }

    function bindEvent(data, bubble) {
        var bindBubble = function(v, idx) {
            var t1;
            var type;
            $(v).mouseenter(function(e) {
                t1 = new Date();
                var $this = $(this);
                var $parent = $this.parent();
                if (_.isUndefined($parent.attr('id'))) {
                    $this.css({'opacity': 1.0, 'cursor': 'pointer'});
                    type = $this.parent().parent().parent().attr('id');
                }
                bubble.hide();
                e.stopPropagation();
                bubble.eq(idx).fadeIn();
            })
            .click(function(e) {
                $.colorbox({
                    html        : buildIncedentHTML(idx, type),
                    width       : "600px",
                    opacity     : 0.82,
                });
            })
            .mouseleave(function(e){
                var t2 = new Date();
                var diff = t2 - t1;
                if (diff>80) {
                    setTimeout(function() {
                        bubble.eq(idx).fadeOut()
                    }, 200)

                }
                else {
                   setTimeout(function() {
                        bubble.eq(idx).fadeOut();
                    }, 300);
                }
            })
        }

        var circle = $('circle', data);
        _.each(circle, function(v, idx) {
            bubble.eq(idx).click(function(e) {
                console.log($(this));
            })
            bindBubble(v, idx);
        })
    }
})