window.accident_on_graph = {"2530":[{"date":"2530","location":"Thai Petrochemical Industry Ltd. (TPI) จ.ระยอง","incedent":"เพลิงลุกไหม้จากการรั่วไหลของเอทิลีน (Ethylene)","effect":"ไม่มีรายงานความเสียหาย"}],"2538":[{"date":"2538","location":"Thai Petrochemical Industry Ltd. (TPI) จ.ระยอง","incedent":"เพลิงลุกไหม้จากการรั่วไหลของเอทิลีน (Ethylene)","effect":"ไม่มีรายงานความเสียหาย"}],"2540":[{"date":"23 พฤษภาคม 2540","location":"โรงเรียนมาบตาพุดพันพิทยาคาร ต.มาบตาพุด อ.เมือง จ.ระยอง","incedent":"เริ่มเกิดปัญหามลพิษทางอากาศ สารเคมีส่งกลิ่นอย่างรุนแรง ","effect":"ครูและนักเรียนโรงเรียนมาบตาพุดพันพิทยาคารนับร้อยถูกหามส่งโรงพยาบาล"}],"2542":[{"date":"12 มิถุนายน 2542","location":"ถนนสาย 3138 (ระยอง-บ้านค่าย) อ.เมือง จ.ระยอง","incedent":"รถบรรทุกกรดไฮโดรคลอริก 35% ขนาด 11 ตัน ของบริษัทซีแอลทราน สปอร์ต จำกัด ระเบิดและรั่วไหล เกิดควันของไอกรดฟุ้งกระจาย","effect":"มีผู้เจ็บป่วยจากการสูดดมก๊าซไฮโดรคลอริก 5 ราย"}],"2543":[{"date":"6 มีนาคม 2543","location":"บริษัท ไทยโพลีคาร์บอเนต จำกัด นิคมอุตสาหกรรมผาแดง อ.เมือง จ.ระยอง","incedent":"ท่อส่งก๊าซคาร์บอนิลคลอไรด์ (ฟอสจีน) เกิดการแตกรั่ว","effect":"ประชาชนได้รับอันตรายจากการสูดดมก๊าซพิษจำนวนมาก เสียชีวิต 1 คน"},{"date":" 18 มิถุนายน 2543","location":"ทางหลวงในเขต กิ่ง อ.พนัสนิคม จ.ระยอง","incedent":"รถบรรทุก 10 ล้อ ที่ขนโซดาไฟพลิกคว่ำลงคลอง ทำให้โซดาไฟที่บรรจุในถุงละลายไปกับน้ำ","effect":"คนขับรถเสียชีวิต 1 คน โซดาไฟแพร่กระจายเป็นระยะทาง 8 กม.ทำให้ปลาตายจำนวนมาก"},{"date":"23 พฤศจิกายน 2543","location":"ต.มาบตาพุด อ.เมือง จ.ระยอง","incedent":"รถขนกรดซัลฟูริก 98% ความจุ 12 ตัน พุ่งชนรถคันอื่น ทำให้กรดซัลฟูริกไหลลงคลองข้างทาง","effect":"บาดเจ็บ 2 ราย"}],"2544":[{"date":" 1 มกราคม 2544","location":"ท่าเทียบเรือ บ.อุตสาหกรรมปิโตรเคมีกัลไทย จำกัด จ.ระยอง","incedent":"เรือบรรทุกแอมโมเนียมไนเตรทปริมาณ 125 ตู้คอนเทนเนอร์ล่มขณะขนย้ายสินค้าลงเรือ","effect":"ปลาตายจากสารเคมีรั่วไหล"},{"date":" 4 มีนาคม 2544","location":"อ.เมือง จ.ระยอง","incedent":"รถบรรทุกเทรเลอร์ซึ่งบรรทุกโซดาไฟพลิกตะแคงในซอยเข้าหมู่บ้านตะกาด หมู่ 4 ต.ตะพง อ.เมือง จ.ระยอง สารเคมีไหลลงสู่แหล่งน้ำ","effect":"สารเคมีไหลลงสู่แหล่งน้ำกินของสัตว์เลี้ยงบริเวณทุ่งนา และมีปลาตายจำนวนมาก"},{"date":"5 มีนาคม 2544","location":"นิคมอุตสาหกรรมมาบตาพุด อ.เมือง จ.ระยอง","incedent":"รถบรรทุกสารเคมีซีโฟร์พลิกคว่ำขณะนำส่งสารเคมีที่บริษัทอุตสาหกรรมปิโตรเคมีกัลไทย จำกัด","effect":"ไม่มีรายงานความเสียหาย"},{"date":"6 มีนาคม 2544","location":"นิคมอุตสาหกรรมมาบตาพุด อ.เมือง จ.ระยอง","incedent":"รถบรรทุกของบริษัทเซออนเคมิคอล ซึ่งบรรทุกสาร Butadiene Raffinate จำนวน 16 ตัน พลิกคว่ำ","effect":"ไม่มีรายงานความเสียหาย"},{"date":"7 มีนาคม 2544","location":"บ้านตะกาด หมู่ 4 ต.ตะพง อ.เมือง จ.ระยอง","incedent":"รถบรรทุกสารเคมีพลิกคว่ำทำให้สารเคมี ซึ่งคาดว่าเป็นแคลเซียมออกไซด์ หกหล่นและถูกทิ้งไว้ในบริเวณนั้น","effect":"ส่งผลกระทบต่อดินและหญ้าในบริเวณดังกล่าว ทำให้ดินมีสีจางลง และหญ้าตาย"},{"date":"18 มิถุนายน 2544","location":"ถนนสาย 3138 (ระยอง-บ้านค่าย) อ.เมือง จ.ระยอง","incedent":"รถบรรทุกกรดไฮโดรคลอริก 35% ขนาด 11 ตันของบริษัทซีแอลทราน สปอร์ต จำกัด ระเบิดและรั่วไหล","effect":"กรดไฮโดรคลอริกรั่วไหลลงพื้นถนนเป็นระยะทาง 25 กม. มีผู้เจ็บป่วยจากการสูดดมกรด 5 ราย"}],"2545":[{"date":"10 เมษายน 2545","location":"บริษัท ไทยโดโน-เกนเกน จำกัดกิ่ง อ.นิคมพัฒนา จ.ระยอง","incedent":"เกิดการระเบิดของสารเคมีในถังผสมสาร (ไนโตรเซลลูโลส และสารไวไฟหลายชนิด)","effect":"อาคารผลิตเสียหายทั้งหลัง มูลค่าความเสียหาย50 ล้านบาท และเกิดก๊าซพิษ"},{"date":"13 เมษายน 2545","location":"บริษัท เอสทีดี พรีซีซัน จำกัด อ.บ้านฉาง จ.ระยอง","incedent":"ไฟไหม้โรงงานผลิตพลาสติก","effect":"ความเสียหายมากกว่า 60 ล้านบาท"},{"date":"3 พฤษภาคม 2545","location":"ถนน By-pass สาย 36 กิ่ง อ.นิคมพัฒนา จ.ระยอง","incedent":"รถบรรทุกสาร White Oil ของบริษัท S&R Transport ประสบอุบัติเหตุชนกับรถกระบะทำให้สารเคมีรั่วไหลลงสู่พื้นถนน","effect":"กลิ่นจากไอระเหยของสาร ทำให้เกิดการระคายเคืองตา ผิวหนัง และระบบทางเดินหายใจ"},{"date":"25 มิถุนายน 2545","location":"ห้างหุ้นส่วนจำกัด ไทยผลิตภัณฑ์ก๊าซ ต.เนินพระ อ.เมือง จ.ระยอง","incedent":"เกิดเหตุระเบิดที่โรงงานบรรจุก๊าซ ขณะคนงานถ่ายก๊าซจากถังใหญ่ลงถังเล็ก","effect":"โรงงานได้รับความเสียหาย คนงานเสียชีวิต 1 ราย และได้รับบาดเจ็บ 1 ราย"},{"date":"11 ธันวาคม 2545","location":"ชุมชนบ้านชากกลาง หมู่ 4 ต.ห้วยโป่ง อ.เมือง จ.ระยอง","incedent":"โรงงานอุตสาหกรรมลักลอบนำน้ำกรดมาทิ้ง","effect":"น้ำในคลองเน่าเสีย  เมื่อถูกตามร่างกายจะคันและแสบมาก"}],"2547":[{"date":"3 ธันวาคม 2547","location":"โรงงานซีพีเจริญโภคภัณฑ์ปิโตรเคมี จำกัด กิ่งอำเภอนิคมพัฒนา จ.ระยอง","incedent":"เพลิงไหม้โกดังเก็บวัตถุดิบสำหรับผลิตพีวีซีหรือพลาสติกแผ่นแข็ง","effect":"เพลิงใหม้กว่า 2 ชั่วโมง สูญเสียไม่ต่ำกว่า 100 ล้านบาท"}],"2548":[{"date":"20 กันยายน 2548","location":"โรงงานแปรรูปอาหารทะเล บริษัท เจริญโภคภัณฑ์อาหาร จำกัด จ.ระยอง","incedent":"แอมโมเนียรั่วออกมาจากท่อส่งที่ผุกร่อน","effect":"ไม่มีรายงานความเสียหาย"},{"date":"22 กันยายน 2548","location":"บริษัท มิยูกิ อินดัสทรี (ประเทศไทย) จำกัด นิคมอุตสาหกรรมสยามอิสเทิร์น","incedent":"เพลิงไหม้ถังน้ำมันเตาและน้ำมันดีเซล","effect":"น้ำมันเตาและน้ำมันดีเซลไหม้ไฟไปอย่างละประมาณ 30,000 ลิตร"}],"2549":[{"date":"4 พฤษภาคม 2549","location":"ท่าเรือโรงกลั่นน้ำมัน บริษัท อัลลายแอนซ์ รีไฟน์นิ่ง จำกัด นิคมอุตสาหกรรมมาบตาพุต อ. เมือง จ. ระยอง","incedent":"น้ำมันเตารั่วไหลลงทะเล ขณะกำลังขนถ่ายจากคลังน้ำมันลงเรือ CT 34 ประเทศไทย","effect":"น้ำมันเตารั่วไหลลงทะเลประมาณ 15,000 ลิตร"},{"date":"3 พฤศจิกายน 2549","location":"ถนนสาย 36 กม.31 หมู่ 6 ต.มะขามคู่ อ.นิคมพัฒนา จ.ระยอง","incedent":"รถบรรทุกสารแมททิวลีน บรรจุถัง 200 ลิตร จำนวน 4 ถัง และสารเคมีทินเนอร์ บรรจุถัง 20 ลิตร จำนวน 7 ถัง พลิกคว่ำเกิดไฟลุกไหม้ทั้งคัน","effect":"มีผู้บาดเจ็บเล็กน้อย 1 ราย"},{"date":"16 พฤศจิกายน 2549","location":"บริษัท บริหารและพัฒนาเพื่อการอนุรักษ์สิ่งแวดล้อม จำกัด (มหาชน) ถ.ไอ2 นิคมอุตสาหกรรมมาบตาพุด จ.ระยอง","incedent":"คนงานใช้รถแบ็คโฮผสมขยะในบ่อปรับเสถียรและเติมสารเคมีลงไปทำให้เกิดประกายไฟลุกใหม้กองขยะ","effect":"ไม่มีรายงานความเสียหาย"},{"date":"5 ธันวาคม 2549","location":"ปั๊มน้ำมัน ตันติชัย จำกัด ริมถนนสุขุมวิทเลขที่ 227/10 หมู่ 6 ริมถนนสุขุมวิท ต.ทุ่งควายกิน อ.แกลง จ.ระยอง","incedent":"มีการรั่วไหลของสารระเหยอินทรีย์หลายชนิด โดยเฉพาะสารไฮโดรปิโตรเลียม จากถังเก็บสารเคมีในบริเวณปั้มน้ำมัน","effect":"ประชาชนบริเวณรอบ 300 เมตรสูดดมสารเคมีเกิดการอาเจียน หน้ามืด วิงเวียน และหมดสติ"}],"2550":[{"date":"2 มกราคม 2550","location":"บริษัท จิ้งฮงระยอง จำกัด 81/4 ถนนสายบายพาส 36 ต.เชิงเนิน อ.เมือง จ.ระยอง","incedent":"ไฟไหม้โรงงานเก็บเม็ดพลาสติก","effect":"ไม่มีรายงานความเสียหาย"},{"date":"9 มกราคม 2550","location":"โรงงานบริษัท ไออาร์พีซี (ทีพีไอ) ต. เชิงเนิน อ. เมืองระยอง","incedent":"ไฟไหม้ถังเก็บสารเอทธิลีน ภายในแทงก์ฟาร์มของโรงงานบริษัท ไออาร์พีซี (ทีพีไอ)","effect":"เพลิงไหม้ถังเก็บสารเอทธิลีน 1 ลูก"},{"date":"18 กุมภาพันธ์ 2550","location":"บริเวณถนนบายพาสระยอง-กระทิงลาย ต.มะขามคู่ กิ่ง อ.นิคมพัฒนา จ. ระยอง","incedent":"เกิดไฟไหม้ที่เครื่องยนต์ ภายในรถบรรทุกเม็ดพลาสติกกว่า 1,000 ตัน","effect":"มูลค่าความเสียหายกว่า 1 ล้านบาท"},{"date":"27 สิงหาคม 2550","location":"บริเวณป่าริมถนนสายบายพาส 36 ระหว่างหลักกิโลเมตร 35-36 เขตเทศบาลเมืองมาบตาพุด จ.ระยอง","incedent":"ลักลอบทิ้งกากของเสียจากโรงงานอุตสาหกรรม","effect":"ส่งกลิ่นเหม็นรุนแรงไปทั่วบริเวณ"}],"2551":[{"date":"6 กุมภาพันธ์​ 2551","location":"ภายในซอยกอไผ่ ต.เนินพระ เขตเทศบาลเมืองมาบตาพุด จ.ระยอง","incedent":"มีการลักลอบทิ้งสารเคมี ลักษณะสีขาวข้นจำนวนมาก","effect":"บาดเจ็บ 4 ราย มีอาการเจ็บคอ หายใจไม่สะดวก เวียนศีรษะ อ่อนเพลีย มีผื่น และแสบผิวหนัง"},{"date":"10 มิถุนายน 2551","location":"บริษัท พีทีที ฟีนอล จำกัด นิคมอุตสาหกรรมเหมราช  ถนนปกรณ์สงเคราะห์ ต.ห้วยโป่ง อ.เมือง จ.ระยอง","incedent":"ท่อส่งสารคิวมีน (Cumene) ขนาด 6 นิ้ว รั่วไหลทำให้ก๊าซพิษกระจายไปทั่วโรงงาน","effect":"มีผู้ได้รับบาดเจ็บจากการสูดดมก๊าซพิษทั้งสิ้น 112 ราย ในจำนวนนี้มีอาการสาหัส 33 ราย"},{"date":"6 กันยายน 2551","location":"ริมถนนสาย 36 หมู่ 2 ต.เชิงเนิน จ.ระยอง","incedent":"ลักลอบทิ้งกากของเสียอุตสาหกรรม ลักษณะเป็นก้อนสีดำจำนวนมาก","effect":"ส่งกลิ่นเหม็น ฟุ้งกระจายไปทั่วบริเวณ"}],"2552":[{"date":"31 มกราคม 2552","location":"บริเวณชายหาดแหลมรุ่งเรือง ใกล้กับท่าเทียบเรือของ บริษัท ไออาร์พีซี จำกัด (มหาชน) จ. ระยอง","incedent":"น้ำมันจำนวนมากรั่วไหลออกมาจากเรือบรรทุกน้ำมันและกระจายลงทะเลเป็นบริเวณกว้าง","effect":"คราบน้ำมันแผ่ครอบคลุมพื้นที่เป็นบริเวณกว้าง และถูกคลื่นลมพัดเข้าสู่ชายฝั่งทะเล"},{"date":"13 กุมภาพันธ์​ 2552","location":"บริษัท ปตท. เคมีคอล จำกัด (มหาชน) ถนนไอ นิคมอุตสาหกรรมมาบตาพุด ต.ห้วยโป่ง อ.เมือง จ.ระยอง","incedent":"ก๊าซไฮโดรเจนซัลไฟด์รั่วไหล","effect":"คนงานและผู้รับเหมาจำนวน 27 ราย มีอาการวิงเวียนศีรษะ แน่นหน้าอก หายใจไม่ออก มี 4 รายอาการสาหัส"},{"date":"2 มีนาคม 2552","location":"พื้นที่รกร้างริมคลองน้ำหูคลองสาธารณะ เขตเทศบาลเมืองมาบตาพุด จ.ระยอง","incedent":"มีการลักลอบนำขยะสารเคมีจากโรงงานผลิตเม็ดพลาสติกมาทิ้ง","effect":"กากขยะสารเคมีส่งกลิ่นเหม็นฉุนรุนแรงทั่วบริเวณ"},{"date":"7 พฤษภาคม 2552","location":"บริษัท ไทยคูน เวิลด์ไวด์กรุ๊ป (ประเทศไทย) จำกัด 99 ม.1 นิคมอุตสาหกรรมระยอง อ.นิคมพัฒนา จ.ระยอง","incedent":"ไฟไหม้บริเวณบ่อน้ำมันออแกไนซ์จำนวน 7 บ่อ ภายในโรงงานหลอมเหล็ก","effect":"ไม่มีรายงานความเสียหาย"}],"2555":[{"date":"5 พฤษภาคม 2555","location":"นิคมอุตสาหกรรมมาบตาพุด อ.เมือง จ.ระยอง","incedent":"เหตุเพลิงไหม้โรงงานของบริษัท บีเอสที อิลาสโตเมอร์ส จำกัด ในเครือบริษัท กรุงเทพ ซินธิติกส์ จำกัด","effect":"มีผู้เสียชีวิต 11 คนและบาดเจ็บ 181 คน"}]}

/*
    GENERATE Timeline incident.
    grouped = _.groupBy(data, function(res) {
      return _.last(res.date.split(" "));
    });
*/

window.event_on_graph = {"2523":[{"date":"ธันวาคม 2523","incident":"รัฐบาลภายใต้การนำของพล.อ.เปรม ติณสูลานนท์ ตั้งคณะกรรมการพัฒนาพื้นที่บริเวณชายฝั่งทะเลตะวันออก(กพอ.) ซึ่งมีพล.อ.เปรม เป็นประธานคณะกรรมการชุดดังกล่าว"}],"2524":[{"date":"มกราคม 2524","incident":"นายกรัฐมนตรีของประเทศญี่ปุ่นออกแถลงการณ์ด้านความร่วมมือในการพัฒนาพื้นที่บริเวณชายฝั่งทะเลตะวันออก หรือ อีสเทิร์นซีบอร์ด"},{"date":"เมษายน 2524","incident":"คณะรัฐมนตรีอนุมัติแผนพัฒนาพื้นที่บริเวณชายฝั่งทะเลตะวันออก"},{"date":"ตุลาคม 2524","incident":"โครงการพัฒนาพื้นที่บริเวณชายฝั่งทะเลตะวันออกถูกบรรจุในแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติฉบับที่ 5"}],"2527":[{"date":"กันยายน 2527","incident":"ก่อตั้งการปิโตรเลียมแห่งประเทศไทย(ปตท.)"},{"date":"ธันวาคม 2527","incident":"เริ่มทดลองเดินเครื่องโรงแยกก๊าซ"}],"2528":[{"date":"กุมภาพันธ์ 2528","incident":"รัฐบาลไทยศึกษาความเป็นไปได้และแผนแม่บทโครงการพัฒนาพื้นที่ชายฝั่งมาบตาพุด ท่าเรือแหลมฉบังและนิคมอุตสาหกรรม"}],"2529":[{"date":"พฤศจิกายน 2529","incident":"เริ่มโครงการปิโตรเคมี (NPC-1) ระยะที่ 1 ในพื้นที่บริเวณนิคมอุตสาหกรรมมาบตาพุด"}],"2530":[{"date":"กุมภาพันธ์ 2530","incident":"รัฐบาลดำเนินโครงการนิคมอุตสาหกรรมมาบตาพุด"}],"2531":[{"date":"มกราคม 2531","incident":"รัฐบาลไทยตัดสินใจดำเนินโครงการท่าเรือน้ำลึกมาบตาพุด และอนุมัติโครงการปิโตเคมี ระยะที่ 2 (NPC-2)"},{"date":"สิงหาคม 2531","incident":"ประกาศใช้กฎกระทรวงผังเมืองรวมบริเวณอุตสาหกรรมหลักและชุมชน จ.ระยอง ฉบับที่ 46 (พ.ศ. 2531)"}],"2532":[{"date":"พฤษภาคม 2532","incident":"ปรับปรุงผังเมืองรวมครั้งที่ 1 เนื่องจากพื้นที่ในเขตอุตสาหกรรมไม่เพียงพอต่อการขยายตัวของภาคอุตสาหกรรม"},{"date":"ตุลาคม 2532","incident":"โครงการปิโตรเคมี (NPC-2) ระยะที่ 2 เริ่มเปิดดำเนินการ"}],"2534":[{"date":"พฤษภาคม 2534","incident":"ประกาศใช้กฎกระทรวงผังเมืองรวมบริเเวณอุตสาหกรรมหลักและชุมชน จ.ระยอง ฉบับที่ 102  (พ.ศ. 2534)"}],"2538":[{"date":"2538","incident":"เริ่มโครงการพัฒนาพื้นที่บริเวณชายฝั่งทะเลตะวันออกระยะที่ 2"}],"2540":[{"date":"2540","incident":"มีการขยายพื้นที่อุตสาหกรรมเข้าไปสู่พื้นที่ตอนในโดยเฉพาะอ.ปลวกแดง "}],"2546":[{"date":"12 พฤษภาคม 2546","incident":"ประกาศใช้กฎกระทรวงผังเมืองรวมบริเวณอุตสาหกรรมหลักและชุมชน จังหวัดระยอง พ.ศ. 2546"},{"date":"กรกฎาคม 2546","incident":"ก่อสร้างโรงไฟฟ้าถ่านหินบีแอลซี"}],"2548":[{"date":"2548","incident":"วางแผนแม่บทอุตสาหกรรมปิโตรเคมี ระยะที่ 3 รวมไปถึงการแก้ไขข้อกำหนดผังเมือง อ. บ้านฉาง เพื่ออนุญาตอุตสาหกรรมปิโตรเคมีขั้นต้น"}],"2550":[{"date":"11 มกราคม 2550","incident":"คณะกรรมการสิ่งแวดล้อมแห่งชาติมีมติแต่งตั้งคณะอนุกรรมการเฉพาะกิจเพื่อแก้ไขปัญหามลพิษและกำหนดการพัฒนาในพื้นที่จ.ระยอง เพื่อจัดทำและกำกับแผนปฏิบัติการลดและขจัดมลพิษ"},{"date":"1 ตุลาคม 2550","incident":"ชาวมาบตาพุดฟ้องคณะกรรมการสิ่งแวดล้อมแห่งชาติต่อศาลปกครองจ.ระยอง เพื่อให้ประกาศให้พื้นที่มาบตาพุดและพื้นที่ใกล้เคียงเป็นเขตควบคุมมลพิษ"}],"2551":[{"date":"ธันวาคม 2551","incident":"ระงับแผนแม่บทอุตสาหกรรมปิโตรเคมีระยะที่ 3 ชั่วคราว"}],"2552":[{"date":"3 มีนาคม 2552","incident":"ศาลปกครองมีคำสั่งให้ท้องที่ของเทศบาลเมืองมาบตาพุดและพื้นที่ใกล้เคียง เป็นเขตควบคุมมลพิษ ตามมาตรา 59 ของพ.ร.บ.ส่งเสริมและรักษาคุณภาพสิ่งแวดล้อมแห่งชาติ พ.ศ. 2535"},{"date":"30 เมษายน 2552","incident":"ประกาศคณะกรรมการสิ่งแวดล้อมแห่งชาติฉบับที่ 32 (พ.ศ. 2552) เรื่องกำหนดให้ท้องที่เขต ต.มาบตาพุด ต.ห้วยโป่ง ต.เนินพระ ต.ทับมา ต.มาบข่า ต.บ้านฉาง และอ.เมืองระยอง \nรวมทั้งพื้นที่ทะเลภายในแนวเขตเป็นเขตควบคุมมลพิษ"},{"date":"19 มิถุนายน 2552","incident":"สมาคมต่อต้านสภาวะโลกร้อนร่วมกับชาวบ้านในต.มาบตาพุด และตำบลใกล้เคียงรวม 43 คน ยื่นฟ้องคณะกรรมการสิ่งแวดล้อมแห่งชาติกับพวกรวม 8 คน ต่อศาลปกครองกรณีร่วมกันออกคำสั่ง\nไม่ถูกต้องตามรัฐธรรมนูญฉบับปี 2550 มาตรา 67 วรรคสอง"},{"date":"29 กันยายน 2552","incident":"ศาลปกครองชั้นต้นมีคำสั่งกำหนดมาตรการหรือวิธีการเพื่อบรรเทาทุกข์ชั่วคราวให้ผู้ถูกฟ้องคดีทั้ง 8 สั่งระงับโครงการหรือกิจกรรมที่กำลังดำเนินการก่อสร้างในพื้นที่ ต.มาบตาพุด อ.บ้านฉาง และพื้นที่ใกล้เคียงจ.ระยอง ที่เป็นโครงการหรือกิจการที่มีผลกระทบรุนแรงรวม 76 โครงการไว้ชั่วคราวจนกว่าศาลจะมีคำพิพากษา"},{"date":"18 พฤศจิกายน 2552","incident":"รัฐบาลแต่งตั้งคณะกรรมการแก้ไขปัญหาการปฏิบัติตามมาตรา 67 วรรค 2 ตามรัฐธรรมนูญ เพื่อแก้ไขปัญหาสภาพแวดล้อมในพื้นที่มาบตาพุดจากกรณีประชาชนฟ้องต่อศาลปกครองให้ระงับการก่อสร้างโครงการที่น่าจะมีผลกระทบต่อสิ่งแวดล้อมและสุขภาพ โดยมีการตั้งคณะกรรมการ 4 ฝ่ายซึ่งมีนายอานันท์ ปันยารชุน อดีตนายกรัฐมนตรีเป็นประธาน เพื่อร่วมกันกำหนดทิศทางและแนวทางแก้ไขปัญหามลพิษที่จะไม่กระทบเศรษฐกิจ และจัดตั้งองค์การอิสระด้านสิ่งแวดล้อมและสุขภาพทำหน้าที่ให้ความเห็นเพิ่มเติมนอกจากรายงานผลกระทบสิ่งแวดล้อมและสุขภาพ"},{"date":"2 ธันวาคม 2552","incident":"ศาลปกครองมีคำสั่งแก้คำสั่งของศาลปกครองชั้นต้น โดยให้ชะลอ 65 โครงการในนิคมอุตสาหกรรมมาบตาพุดและบริเวณใกล้เคียง และให้ 11 โครงการที่ไม่มีผลกระทบต่อสิ่งแวดล้อม ทรัพยากรธรรมชาติ\nและคุณภาพชีวิตของประชาชนสามารถดำเนินการได้ ได้แก่ โครงการเชื้อเพลิงและแก๊ส 4 โครงการ โครงการเหล็ก 2 โครงการ และปิโตรเคมีและเคมีภัณฑ์ 5 โครงการ"},{"date":"15 ธันวาคม 2552","incident":"จากเหตุการณ์ก๊าซรั่วในนิคมอุตสาหกรรมมาบตาพุดหลายครั้งที่ผ่านมา ทำให้ผู้ประกอบการในนิคมฯได้ประสานงานกับศูนย์เฝ้าระวังและควบคุมคุณภาพสิ่งแวดล้อม(EMC2) ของสำนักงานนิคมอุตสาหกรรมมาบตาพุด(สนพ.)จัดตั้งวอร์รูมและทีมเฝ้าระวังสิ่งแวดล้อมซึ่งมีการตรวจพื้นที่ตลอด 24 ชั่วโมง"}],"2553":[{"date":"19 มกราคม 2553","incident":"คณะรัฐมนตรีอนุมัติให้มีการแต่งตั้งคณะกรรมการการประสานงานองค์กรอิสระ ซึ่งจะเป็นผู้ให้ความเห็นชอบต่อโครงการรุนแรงโดยมีนายอานันท์ ปันยารชุน เป็นประธาน"},{"date":"22 มกราคม 2553","incident":"ศาลปกครองกลางมีคำสั่งยกคำร้อง 30 โครงการที่ยื่นเสนอให้ศาลปกครองกลางทบทวนคำสั่งคุ้มครองชั่วคราวให้ระงับการดำเนินการ"},{"date":"26 มกราคม 2553","incident":"คณะรัฐมนตรีตั้งคณะกรรมการประสานให้คำปรึกษาภาคเอกชน ในการดำเนินการตามมาตรา 67 (2) ของรัฐธรรมนูญ โดยมีนายสุรยุทธ เพชรตระกูล ผู้ช่วยรัฐมนตรีอุตสาหกรรมในขณะนั้นเป็นประธาน"},{"date":"11 พฤษภาคม 2553","incident":"ผังเมืองรวมบริเวณอุตสาหกรรมหลักและชุมชน จ.ระยอง พ.ศ. 2546 หมดอายุ (ขยายอายุการบังคับใช้ 2 ครั้งๆละ 1 ปี) และมีการดำเนินการปรับปรุงผังเมืองรวมบริเวณ\nอุตสาหกรรมหลักและชุมชนจ.ระยองใหม่แทนผังเมืองเดิม โดยว่าจ้างบริษัทพิสุทธิ์ เทคโนโลยี จำกัดเป็นที่ปรึกษา"},{"date":"31 สิงหาคม 2553","incident":"คณะรัฐมนตรีมีมติรับรอง 11 โครงการรุนแรง โดยร่างประกาศกระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม เรื่อง กำหนดประเภท ขนาด และวิธีปฏิบัติสำหรับโครงการหรือกิจการที่อาจก่อให้เกิดผลกระทบต่อชุมชนอย่างรุนแรงทั้งทางด้านคุณภาพ สิ่งแวดล้อม ทรัพยากรธรรมชาติและสุขภาพ ที่ส่วนราชการ รัฐวิสาหกิจ หรือ เอกชน จะต้องจัดทำรายงานการวิเคราะห์ผลกระทบสิ่งแวดล้อมพ.ศ. 2553"},{"date":"1 กันยายน 2553","incident":"องค์กรภาคประชาชนออกแถลงการณ์คัดค้านมติคณะรัฐมนตรีเมื่อวันที่ 31 สิงหาคม 2552 ที่ไม่เป็นไปตามข้อเสนอของคณะกรรมการ 4 ฝ่ายที่เสนอให้กำหนด 18 ประเภทโครงการที่ละเมิดสิทธิของ\nประชาชนตามมาตรา 67 วรรค 2 ของรัฐธรรมนูญ"},{"date":"2 กันยายน 2553","incident":"ศาลปกครองกลาง มีคำสั่งให้ 74 โครงการสามารถดำเนินการต่อไปได้ โดยมี 2 โครงการที่ไม่ผ่านคือ โครงการโรงงานผลิตเอทิลีนออกไซด์ และเอทิลีน ไกลคอน ของบริษัท ทีโอซี ไกลคอน จำกัด ในเครือบมจ.ปตท.เคมิคอล และโครงการขยายกำลังการผลิตไวนิลคอลไรด์โมโนเมอร์ บมจ.ไทยพลาสติกและเคมีภัณฑ์ โดยศาลให้คณะกรรมการสิ่งแวดล้อมไปพิจารณาว่าเข้าข่ายโครงการที่มีผลกระทบรุนแรงหรือไม่"},{"date":"6 กันยายน 2553","incident":"คณะกรรมการ 4 ฝ่ายแถลงการณ์ถึงกรณีที่รัฐบาลตัดประเภทกิจการที่อาจก่อให้เกิดผลกระทบที่รุนแรงทั้งทางคุณภาพสิ่งแวดล้อม ทรัพยากรธรรมชาติ และสุขภาพ จากที่เสนอไป 18 ประเภท\nเหลือเพียง 11 ประเภทโดยให้รัฐบาลชี้แจงเป็นลายลักษณ์อักษร"},{"date":"30 กันยายน 2553","incident":"กลุ่มเครือข่ายประชาชน รวมตัวกันเรียกร้องให้รัฐบาลทบทวนหรือยกเลิก 11 กิจการมาบตาพุดที่อาจก่อความรุนแรงให้กับชุมชน โดยให้รัฐบาลกลับมาพิจารณาโครงการ 18 ประเภทตามข้อเสนอของคณะกรรมการ 4 ฝ่าย แต่รัฐบาลไม่ดำเนินการทบทวน"}],"2554":[{"date":"11 มกราคม 2554","incident":"ที่ประชุมคณะรัฐมนตรีมีมติอนุมัติแผนงานแก้ไขปัญหาเร่งด่วนของมาบตาพุด (เพิ่มเติม) ในวงเงิน 255 ล้านบาท เพื่อขยายเขตประปา ตรวจสุขภาพ และตั่งสถานีตรวจวัดคุณภาพอากาศ การดูแลเรื่องมลพิษ และสิ่งแวดล้อมของชุมชนในเขตมาบตาพุด"},{"date":"กุมภาพันธ์ 2554","incident":"บริษัทพิสุทธิ์ เทคโนโลยี เสนอรายงานฉบับสุดท้าย ในโครงการจ้างที่ปรึกษาดำเนินการจัดทำปรับปรุงผังเมืองรวมบริเวณอุตสาหกรรมหลักและชุมชน จ.ระยอง(ปรับปรุงครั้งที่ 3) ต่อคณะที่ปรึกษาผังเมืองรวมฯ ที่มีผู้ว่าราชการจ.ระยองเป็นประธานให้ดำเนินการพิจารณาให้ความเห็น"},{"date":"9 กุมภาพันธ์ 2554","incident":"การนิคมอุตสาหกรรมแห่งประเทศไทย(กนอ.) สำนักงานคณะกรรมการส่งเสริมการลงทุน(บีโอไอ) อยู่ระหว่างร่วมกันศึกษาแนวทางการกำหนดสิทธิประโยชน์ของอุตสาหกรรมเชิงนิเวศน์หรืออีโคทาวน์"}],"2555":[{"date":"18 มิถุนายน 2555","incident":"ที่ประชุมคณะรัฐมนตรีมีมติเห็นชอบแผนการแก้ไขปัญหามาบตาพุดอย่างครบวงจร ในระยะเวลา 5 ปี 2555-2559 ตามที่สำนักงานคณะกรรมการพัฒนาการเศรษฐกิจและสังคมแห่งชาติ (สศช.)\nเสนอ โดยมีโครงการที่ต้องดำเนินงานจำนวน 92 โครงการ วงเงินรวม 4,347 ล้านบาท"}]};
window['graph-Accident'+'List']=  _.collect(accident_on_graph, function(v, k) { return v; });



window['graph-Event'+'List']=  _.collect(event_on_graph, function(v, k) { return v });
var pmList = {
    2523: {
        'fullname': 'พล.อ.เปรม ติณสูลานนท์',
        'hold_years': 'พศ.2523 - พศ.2529',
        'events': [{
            date: 'มีนาคม 2524',
            incident: 'ริเริ่มโครงการพัฒนาพื้นที่ชายฝั่งทะเลตะวันออก ระยะที่ 1 มีการมอบหมายให้สำนักผังเมืองดำเนินการวางผังเมืองรวมบริเวณอุตสาหกรรมหลักและชุมชนจังหวัดระยอง'
        }, {
            date: 'พฤศจิกายน 2529',
            incident: 'ทำพิธีเปิดนิคมอุตสาหกรรมมาบตาพุด'
        }]
    },
    2531: {
        'fullname': 'พล.อ.ชาติชาย ชุณหะวัณ',
        'hold_years': 'พศ.2531 - พศ.2534',
        'events': [{
            date: '2531',
            incident: 'ตั้งเป้าให้ไทยเป็นเสือตัวที่ 5 ขอเอเชีย ทำให้มีการขยายพื้นที่นิคมอุตสาหกรรมออกไปจาก 8,000 ไร่เป็น 20,000 ไร่'
        }, {
            date: '5 สิงหาคม 2531',
            incident: 'มีการประกาศใช้ผังเมืองมาบตาพุดปี 2531 พร้อมกับลงทุนก่อสร้างโรงงานปิโตรเคมีและพลาสติกเป็นจำนวนมาก'
        }]
    },
    2534: {
        'fullname': 'นายอานันท์ ปันยารชุน',
        'hold_years': 'พศ.2534 - พศ.2535',
        'events': [{
            date: '21 พฤษภาคม 2534',
            incident: 'ประกาศใช้ผังเมืองปีพ.ศ. 2534'
        }]
    },
    2535: {
        'fullname': 'นายชวน หลีกภัย',
        'hold_years': 'พศ.2535 - พศ.2538',
        'events': [{
            date: 'พ.ศ. 2538',
            incident: 'วางแผนต่อเนื่องเข้าสู่แผนพัฒนาพื้นที่ชายฝั่งทะเลตะวันออก ระยะที่ 2'
        }]
    },
    2538: {
        'fullname': 'นายบรรหาร ศิลปอาชา',
        'hold_years': 'พศ.2538 - พศ.2539',
        'events': [{
            date: 'พ.ศ. 2539',
            incident: 'มีการสร้างโรงกลั่นน้ำมันในพื้นที่กันชนระหว่างอุตสาหกรรมและชุมชน'
        }]
    },
    2539: {
        'fullname': 'พล.อ.ชวลิต ยงใจยุทธ',
        'hold_years': 'พศ.2539 - พศ.2540',
        'events': [{
            date: 'พ.ศ.2540',
            incident: 'เริ่มเกิดการร้องเรียนของชาวมาบตาพุดจากปัญหามลพิษทางอากาศ'
        }]
    },
    2540: {
        'fullname': 'นายชวน หลีกภัย (2)',
        'hold_years': 'พศ.2540 - พศ.2543',
        'events': [{
            date: 'มิถุนายน 2541',
            incident: 'เกิดผลกระทบจากมลพิษทางอากาศที่มาจากโรงกลั่นน้ำมันและโรงงานเคมีในนิคมอุตสาหกรรมมาบตาพุด ทำให้เด็กนักเรียนโรงเรียนมาบตาพุดพันพิทยาคาร นับร้อยคนล้มป่วยจนต้องหามส่งโรงพยาบาล ต่อมามีคำสั่งหยุดโรงงานชั่วคราวจำนวน 6 โรงงาน และย้ายโรงเรียนดังกล่าวให้ห่างจากที่ตั้งเดิม 5 กิโลเมตร คณะกรรมการสิ่งแวดล้อมแห่งชาติมีมติให้ประเมินศักยภาพการรับรองมลพิษของพื้นที่'
        }]
    },
    2544: {
        'fullname': 'พ.ต.ท.ทักษิณ ชินวัตร',
        'hold_years': 'พศ.2544 - พศ.2549',
        'events': [{
            date: 'พ.ศ. 2544',
            incident: 'เข้าสู่แผนพัฒนาพื้นที่ชายฝั่งทะเลตะวันออก ระยะที่ 2 มีการขยายอุตสาหกรรมเข้าไปสู่พื้นที่ตอนใน โดยเฉพาะอำเภอปลวกแดง'
        }, {
            date: '12พฤษภาคม 2546',
            incident: 'ประกาศใช้ผังเมืองปี 2546 โดยขยายพื้นที่อุตสาหกรรมไปทับซ้อนกับพื้นที่ของชุมชนในหลายชุมชน และขยายไปสู่เขต อ. บ้านฉาง'
        }, {
            date: 'กรกฎาคม 2546 ',
            incident: 'ก่อสร้างและดำเนินการโรงไฟฟ้าถ่านหินบีแอลซี'
        }, {
            date: 'พ.ศ. 2548',
            incident: 'วางแผนแม่บทอุตสาหกรรมปิโตรเคมี ระยะ 3 และมีการแก้ไขข้อกำหนดผังเมือง อ.บ้านฉางเพื่ออนุญาตอุตสาหกรรมปิโตรเคมีขั้นต้น รวมไปถึงการอนุมัติโครงการอุตสาหกรรมเคมี โรงไฟฟ้าและอื่นๆ'
        }, {
            date: 'กันยายน 2549',
            incident: 'กรมควบคุมมลพิษตรวจสอบพบสารอินทรีย์ระเหยก่อมะเร็ง 19 ชนิด มีค่าสูงกว่ามาตรฐานของสหรัฐอเมริกา'
        }, {
            date: '2549',
            incident: 'เกิดภัยแล้งจากภาวะขาดแคลนน้ำในพื้นที่ ส่งผลให้เกิดการแย่งใช้น้ำระหว่างชุมชนกับภาคอุตสาหกรรม'
        }, {
            date: '2549',
            incident: 'องค์กรเอกชนรณรงค์ให้รัฐบาลพิจารณาประกาศให้พื้นที่มาบตาพุดเป็นเขตควบคุมมลพิษ'
        }, {
            date: '2549',
            incident: 'รัฐบาลไม่ประกาศเขตควบคุมมลพิษ แต่ให้การนิคมอุตสาหกรรมแห่งประเทศไทย (กนอ.) และผู้ประกอบการในนิคมฯ ว่าจ้างที่ปรึกษาเพื่อประเมินศักยภาพการรองรับมลพิษ ได้ข้อสรุปเบื้องต้นว่า พื้นที่มาบตาพุดไม่สามารถรองรับอุตสาหกรรมได้อีกต่อไป'
        }]
    },
    2549: {
        'fullname': 'พล.อ.สุรยุทธ์ จุลานนท์',
        'hold_years': 'พศ.2549 - พศ.2551',
        'events': [{
            date: '1 ตุลาคม 2550',
            incident: 'ชาวมาบตาพุดฟ้องคณะกรรมสิ่งแวดล้อมแห่งชาติต่อศาลปกครองระยอง เพื่อให้ปฏิบัติหน้าที่ตาม พ.ร.บ.ส่งเสริมและรักษาคุณภาพสิ่งแวดล้อม พ.ศ.2535 มาตรา 59 หรือการประกาศให้พื้นที่มาบตาพุดและพื้นที่ใกล้เคียงเป็นเขตควบคุมมลพิษ'
        }, {
            date: '11 มกราคม 2550',
            incident: 'คณะกรรมการสิ่งแวดล้อมฯ มีมติแต่งตั้งคณะอนุกรรมการเฉพาะกิจเพื่อแก้ไขปัญหามลพิษและกำหนดการพัฒนาในพื้นที่จ.ระยองเพื่อจัดทำและกำกับแผนปฏิบัติการลดและขจัดมลพิษในพื้นที่จ.ระยอง'
        }, {
            date: 'พ.ศ. 2550 – 2554',
            incident: 'กำหนดค่าเฝ้าระวังเฉลี่ยรายปีสารอินทรีย์ระเหยก่อมะเร็ง 9 ชนิด เกิดกระบวนการสมัชชาสุขภาพและการประเมินผลกระทบทางสุขภาพ'
        }, ]
    },
    2551: {
        'fullname': 'นายอภิสิทธิ์ เวชชาชีวะ',
        'hold_years': 'พศ.2551 - พศ.2553',
        'events': [{
            date: '3 มีนาคม 2552',
            incident: 'ประกาศให้พื้นที่ต.มาบตาพุดและบริเวณใกล้เคียงเป็นเขตควบคุมมลพิษ'
        }, {
            date: '29 กันยายน 2552',
            incident: 'ระงับโครงการพัฒนาพื้นที่ชายฝั่งทะเลตะวันออก ระยะที่ 3 ชั่วคราว ใน 76 โครงการเพื่อคุ้มครองชุมชนมาบตาพุดโดยศาลปกครอง'
        }, {
            date: '13 พฤศจิกายน 2552',
            incident: 'รัฐบาลแต่งตั้งคณะกรรมการแก้ไขปัญหาการปฏิบัติตามมาตรา 67 วรรคสอง ของรัฐธรรมนูญแห่งราชอาณาจักรไทย (คณะกรรมการ 4 ฝ่าย) มีหน้าที่จัดทำข้อยุติเพื่อเสนอให้นายกรัฐมนตรีพิจารณาดำเนินการตามอำนาจหน้าที่ให้สอดคล้องกับบทบัญญัติรัฐธรรมนูญแห่งราชอาณาจักรไทย มาตรา 67 วรรคสอง'
        }, {
            date: '1 ธันวาคม 2552',
            incident: 'แก้ไขปัญหาเร่งด่วนของประชาชน และการลดและขจัดมลพิษในพื้นที่มาบตาพุดและบริเวณใกล้เคียง โดยหน่วยงานต่างๆได้รับอนุมัติจากคณะรัฐมนตรีให้ดำเนินโครงการมาโดยลำดับ 4 ครั้งจำนวนรวม 32 โครงการ วงเงินรวม 1,432 ล้านบาท'
        }, {
            date: '8 กรกฎาคม 2553',
            incident: 'จัดทำแผนปฏิบัติการเพื่อลดและขจัดมลพิษในเขตควบคุมมลพิษ จ.ระยอง พ.ศ. 2553-2556 ประกอบด้วย 7 แผนงาน 71 โครงการ วงเงินรวม 2,182 ล้านบาท'
        }, {
            date: '1 ธันวาคม 2552',
            incident: 'การแก้ไขปัญหาเร่งด่วนของประชาชน และการลดและขจัดมลพิษในพื้นที่มาบตาพุดและบริเวณใกล้เคียง โดยหน่วยงานต่างๆ ได้รับอนุมัติจากคณะรัฐมนตรีให้ดำเนินโครงการมาโดยลำดับ 4 ครั้ง จำนวนรวม 32 โครงการ วงเงินรวม 1,432 ล้านบาท'
        }]
    },
    2553: {
        'fullname': 'น.ส.ยิ่งลักษณ์ ชินวัตร',
        'hold_years': 'พศ.2553 - ปัจจุบัน',
        'events': [{
            date: '4 เมษายน 2554',
            incident: 'ที่ประชุมคณะรัฐมนตรีมีมติเห็นชอบแผนการแก้ไขปัญหามาบตาพุดอย่างครบวงจร ระยะเวลา 5 ปี 2555-2559 ตามที่สำนักงานคณะกรรมการพัฒนาการเศรษฐกิจและสังคมแห่งชาติ (สศช.)เสนอ ซึ่งมีโครงการที่ต้องดำเนินงานกว่า 92 โครงการ วงเงินรวม 4,347 ล้านบาท'
        }]
    },
};

window.buildincidentHTML = function(idx, type) {
    var splitterMap = { 'graph-Event' : ' ', 'graph-Accident': '/' };
    var html = _.template("<div class='event-<%= type %>'>\
        <div class='incident-year'> <%= incident_year %> </div>\
        <ul id='incident-<%= type %>'>")
    var make_li = _.template(" <li>\
                                    <div class='time'><%= date %></div>\
                                    <div class='incident'> <%= incident %> </div>\
                                    <div class='detail'>\
                                    <% if (type=='graph-Accident') { %> \
                                        <span>สถานที่&nbsp;:&nbsp;</span> <%= location %><br />\
                                        <span>ผลกระทบ&nbsp;:&nbsp;</span> <%= effect %>\
                                    <% } %>\
                                    </div>\
                                </li>");
    var obj = window[type + 'List'];
    var html_bef;
    var html_body = "";

    if (!_.isUndefined(obj)) {
        _.each(obj[idx], function(v, k) {
            _.extend(v, {type: type, incident_year: _.last(v.date.split(splitterMap[type])) });
            html_bef = html(v);
            html_body += make_li(v);
        });
    }

    html = html_bef + html_body + "</ul></div>";
    return  html;
}

$(document).ready(function() {
    !function construct_pm_box() {
        var common_css = { 'z-index': 500, opacity: 0, width: '32', height: '32', background: 'red', position: 'absolute', top: '23px', float: 'left' };
        var e = {
            "2523-primeMinister": { left: '147px' },
            "2531-primeMinister": { left: '305px' },
            "2534-primeMinister": { left: '350px' },
            "2535-primeMinister": { left: '400px' },
            "2538-primeMinister": { left: '445px' },
            "2551-primeMinister": { left: '773px' },
            "2539-primeMinister": { left: '475px' },
            "2540-primeMinister": { left: '520px' },
            "2544-primeMinister": { left: '640px' },
            "2549-primeMinister": { left: '723px' },
            "2553-primeMinister": { left: '822px' }
        };

        _.each(e, function(i, k) {
          $('#slider-range-max > div').append($('<div>').attr({id: k}).css(common_css).css(i));
        });
    }();
            // ON PRIMINISTER CLICK
            $('div[id$="primeMinister"]').
                mouseover(function(e) {
                    $(this).css({ cursor: 'pointer'});

                    var pmId = $(this).attr('id').split('-')[0],
                        pmFullname = pmList[pmId] ? pmList[pmId]['fullname'] : ''
                    ;
                    $(this).tipsy({
                        className: 'prime-minister-tipsy',
                        gravity: 'n',
                        fallback: 'รัฐบาล ' + pmFullname
                    })
                    .tipsy("show");
                }).
                mousedown(function(e){
                    e.stopPropagation();
                    var pmId = $(this).attr('id').split('-')[0];
                    $.colorbox({
                        html        :buildPMInfo(pmId),
                        width       :"600px",
                        opacity     :0.82,
                        height      : "75%"
                    });
                });


    // var svgprime = $('#svgprime').svg();
    //     svgprime.load('PrimeMinister.svg?'+Math.random(), 'get', function (svg) {
    //     });

    var svggraph = $('#svggraph').svg();
    svggraph.load('graph.svg?'+Math.random(), 'get', function (svg) {
        var data = $('svg > g', $('#svggraph'));
        window.activeLayers2 = [];

        window.gr2 = _.groupBy(data, function(i) {
            return i.id.split('_')[0] || 'other';
        });

        // CREATE LAYER MANAGER
        window.LayerManager2 = CreateLayerManager(gr2, activeLayers2); // LAYER MANAGER
        LayerManager2.show('graph', ['Factory', 'Accident', 'Event', 'GPP', 'people', 'peopleHide']);

        // BIND EVENT
        bindEvent(LayerManager2.funcs['graph-Factory'].data(), jQuery('[id$="factoryBubble"]'));
        bindEvent(LayerManager2.funcs['graph-GPP'].data(), jQuery('[id$="gppBubble"]'));
        bindEvent(LayerManager2.funcs['graph-Accident'].data(), jQuery('[id$="accidentBubble"]'));
        bindEvent(LayerManager2.funcs['graph-Event'].data(), jQuery('[id$="event"]'));
        bindEvent(LayerManager2.funcs['graph-people'].data(), jQuery('[id$="people-bubble"]'));
        bindEvent(LayerManager2.funcs['graph-peopleHide'].data(), jQuery('[id$="peopleHide-bubble"]'));
    });
    function buildPMInfo(year) {
        var pm = pmList[year];
        var events_html = "<ul>";
        var events_template = _.template("<li><div class='time'><%= date %></div> <div class='data-year'><%= incident %></div> </li>");
        _.each(pm['events'], function(data) {
            events_html += events_template(data);
        })
        events_html += "</ul>";

        var template = _.template("<div class='primebox'> \
                                        <img src='asset/primeminister/<%= year %>-primeMinister.png'/> \
                                        <div class='fullname'> \
                                            <%= fullname %> \
                                        </div> \
                                        <div class='-bubbleldyear'> <%= hold_years %> </div> \
                                        <p class='events'>  <%= events_html %> </p> \
                                    </div>");
        var data = { fullname: pm.fullname, hold_years: pm.hold_years,
            year: year, events_html: events_html
        };
        return  template(data);
    }

    function bindEvent(data, bubble) {
        var bindBubble = function(v, idx) {
            var t1, type, $opa;
            $(v).mouseenter(function(e) {
                var $this = $(this)
                  , $parent = $this.parent();

                t1 = new Date();
                e.stopPropagation();

                if (_.isUndefined($parent.attr('id'))) {
                    $this.css({'opacity': 1.0, 'cursor': 'pointer'});
                    type = $this.parent().parent().parent().attr('id');
                    $opa = $this.parent().parent();
                    $opa.animate({opacity: 1.0}, 0);
                }
                else {
                    $opa = undefined;
                }

                bubble.hide();
                // console.log($opa, $opa.attr('id'))

                bubble.eq(idx).fadeIn();

            })
            .click(function(e) {
                var $parent = $(this).parent()
                  , id = $parent.attr('id');

                if (_.isUndefined(id)) {
                    $.colorbox({
                        html        : buildincidentHTML(idx, type),
                        width       : "600px",
                        opacity     : 0.82,
                        height      : "75%"
                    });
                }

            })
            .mouseleave(function(e){
                var t2 = new Date()
                  , diff = t2 - t1;
                var $this = $(this);

                // $this.attr({opacity: 0.5})
                // $this.parent().attr({opacity: 0.5})
                // $this.parent().parent().attr({opacity: 0.5})
                if (diff>80) {
                    setTimeout(function delayFadeOut() {
                        if ($opa) {
                            $opa.animate({opacity: 0.5});
                        }
                        bubble.eq(idx).fadeOut();
                    }, 200);
                }
                else {
                    setTimeout(function muchDelayFadeOut() {
                        if ($opa) {
                            $opa.animate({opacity: 0.5});
                        }
                        bubble.eq(idx).fadeOut();
                    }, 300);
                }
            });
        };

        var circle = $('circle', data);
        _.each(circle, function(v, idx) {
            bindBubble(v, idx);
        });
    }
})