var pmList = {
    2523: { 
        'fullname'    : 'พล.อ.เปรม ติณสูลานนท์', 
        'hold_years': 'พศ.2523 - พศ.2529',
        'events'      : [
            'มีนาคม 2524 - ริเริ่มโครงการพัฒนาพื้นที่ชายฝั่งทะเลตะวันออกเฟสที่ 1 มีการมอบหมายให้สำนักผังเมืองดำเนินการวางผังเมืองรวมบริเวณอุตสาหกรรมหลังและชุมชนจังหวัดระยอง',
            'พฤศจิกายน 2529 ทำพิธีเปิดนิคมอุตสาหกรรมมาบตาพุด'
        ]
    },
    2531: {
        'fullname'  : 'พล.อ.ชาติชาย ชุณหะวัณ',
        'hold_years': 'พศ.2531 - พศ.2534',
        'events'    : [
            'ตั้งเป้าให้ไทยเป็นเสือตัวที่ 5 ขอเอเชีย ทำให้มีการขายพื้นที่นิคมอุตสาหกรรมออกไปจาก 8,000 ไร่เป็น 20,000 ไร่',
            '5 สิงหาคม 2531 มีการประกาศใช้ผังเมืองมาบตาพุดปี 2531 พร้อมกับลงทุนก่อสร้างโรงงานปิโตรเคมีและพลาสติกเป็นจำนวนมาก'
        ]
    },
    2534: {
        'fullname'  : 'นายอานันท์ ปันยารชุน',
        'hold_years': 'พศ.2534 - พศ.2535',
        'events'    : [
            '21 พฤษภาคม 2534 ประกาศใช้ผังเมืองปีพ.ศ. 2534'
        ]
    },
    2535: {
        'fullname'  : 'นายชวน หลีกภัย',
        'hold_years': 'พศ.2535 - พศ.2538',
        'events'    : [
            'พ.ศ. 2538 วางแผนต่อเนื่องเข้าสู่แผนพัฒนาชายฝั่งทะเลตะวันออกเฟสที่ 2'
        ]
    },
    2538: {
        'fullname'  : 'นายบรรหาร ศิลปอาชา',
        'hold_years': 'พศ.2538 - พศ.2539',
        'events'    : [
            'พ.ศ. 2539 มีการสร้างโรงกลั่นน้ำมันในพื้นที่กันชนระหว่างอุตสาหกรรมและชุมชน'
        ]
    },
    2539: {
        'fullname'  : 'พล.อ.ชวลิต ยงใจยุทธ',
        'hold_years': 'พศ.2539 - พศ.2540',
        'events'    : [
            'พ.ศ.2540 เริ่มเกิดการร้องเรียนของชาวบ้าน ครู และนักเรียน จากปัญหามลพิษทางอากาศ'
        ]
    },
    2540: {
        'fullname'  : 'นายชวน หลีกภัย (2)',
        'hold_years': 'พศ.2540 - พศ.2543',
        'events'    : [
            'มิถุนายน 2541 เกิดผลกระทบจากมลพิษทางอากาศที่มาจากโรงกลั่นน้ำมันและโรงงานเคมีในนิคมอุตสาหกรรมมาบตาพุด ทำให้เด็กนักเรียนโรงเรียนมาบตพุดพันพิทยาคาร นับร้อยล้มป่วยจนต้องหามส่งโรงพยาบาล / หยุดโรงงานชั่วคราวจำนวน 6 โรงงาน ย้ายโรงเรียนให้ห่างจากที่ตั้งเดิม 5 กิโลเมตร คณะกรรมการสิ่งแวดล้อมแห่งชาติมีมติให้ประเมินศักยภาพการรับรองมลพิษของพื้นที่'
        ]
    },
    2544: {
        'fullname'  : 'พ.ต.ท.ทักษิณ ชินวัตร',
        'hold_years': 'พศ.2544 - พศ.2549',
        'events'    : [
            'พ.ศ. 2544 เข้าสู่แผนพัฒนาชายฝั่งทะเลตะวันออกเฟส 2 มีการขยายอุตสาหกรรมเข้าไปสู่พื้นที่ตอนใน โดยเฉพาะอำเภอปลวกแดง',
            '12พฤษภาคม 2546  ประกาศใช้ผังเมืองปี 2546โดยขยายพื้นที่อุตสาหกรรมไปทับซ้อนกับหลายชุมชน และขยายไปสู่เขต อ. บ้านฉาง',
            'กรกฎาคม 2546 ก่อสร้างและดำเนินการโรงไฟฟ้าถ่านหินบีแอลซี',
            'พ.ศ. 2548 วางแผนแม่บทอุตสาหกรรมปิโตรเคมีเฟสที่ 3 / แก้ไขข้อกำหนดผังเมือง อ.บ้านฉางเพื่ออนุญาตอุตสาหกรรมปิโตรเคมีขั้นต้น / อนุมัติโครงการอุตสาหกรรมเคมี โรงไฟฟ้าและอิ่นๆ',
            'กันยายน 2549 กรมควบคุมมลพิษตรวจสอบพบสารอินทรีย์ระเหยก่อมะเร็ง 19 ชนิด มีค่าสูงกว่ามาตรฐานของสหรัฐอเมริกา',
            'เกิดภัยแล้งจากภาวะขาดแคลนน้ำในพื้นที่ ส่งผลให้เกิดการแย่งใช้น้ำระหว่างชุมชนกับภาคอุตสาหกรรม',
            'องค์กรเอกชนรณรงค์ให้รัฐบาลพิจารณาประกาศให้พื้นที่มาบตาพุดเป็นเขตควบคุมมลพิษ',
            'รัฐบาลไม่ประกาศเขตควบคุมมลพิษ แต่ให้การนิคมอุตสาหกรรมแห่งประเทศไทย (กนอ.) และผู้ประกอบการในนิคมฯ ว่าจ้างที่ปรึกษา เพื่อประเมินศักยภาพการรองรับมลพิษ ได้ข้อสรุปเบื้องต้นว่า พื้นที่มาบตาพุด ไม่สามารถรองรับอุตสาหกรรมได้อีกต่อไป'
        ]
    },
    2549: {
        'fullname'  : 'พล.อ.สุรยุทธ์ จุลานนท์',
        'hold_years': 'พศ.2549 - พศ.2551',
        'events'    : [
            '1 ตุลาคม 2550 และชาวบ้านมาบตาพุดฟ้องคณะกรรมสิ่งแวดล้อมแห่งชาติต่อศาลปกครองระยองเพื่อให้ปฏิบัติหน้าที่ตาม พ.ร.บ.ส่งเสริมและรักษาคุณภาพสิ่งแวดล้อม พ.ศ.253มาตรา 59 คือประกาศให้พื้นที่มาบตาพุดและพื้นที่ใกล้เคียงเป็นเขตควบคุมมลพิษ',
            '11 มกราคม 2550 คณะกรรมการสิ่งแวดล้อมฯ มีมติแต่งตั้งคณะอนุกรรมการเฉพาะกิจเพื่อแก้ไขปัญหามลพิษและกำหนดการ พัฒนาในพื้นที่จังหวัดระยองเพื่อจัดทำและกำกับแผนปฏิบัติการลดและขจัดมลพิษ ในพื้นที่จังหวัดระยอง',
            'พ.ศ. 2550 – 2554 กำหนดค่าเฝ้าระวังเฉลี่ยรายปีสารอินทรีย์ระเหยก่อมะเร็ง 9 ชนิด กระบวนการสมัชชาสุขภาพและการประเมินผลกระทบทางสุขภาพ'
        ]
    },
    2551: {
        'fullname'  : 'นายอภิสิทธิ์ เวชชาชีวะ',
        'hold_years': 'พศ.2551 - พศ.2553',
        'events'    : [
            '3 มีนาคม 2552 ประกาศให้พื้นที่ตำบลมาบตาพุดและบริเวณใกล้เคียงเป็นเขตควบคุมมลพิษ',
            '29 กันยายน 2552 ระงับโครงการพัฒนาพื้นที่ชายฝั่งทะเลตะวันออกเฟสที่ 3 ชั่วคราว ใน76 โครงการ เพื่อคุ้มครองชุมชนมาบตาพุดโดยศาลปกครอง',
            '13 พฤศจิกายน 2552 รัฐบาลได้แต่งตั้งคณะกรรมการแก้ไขปัญหาการปฏิบัติตามมาตรา 67 วรรคสอง ของรัฐธรรมนูญแห่งราชอาณาจักรไทย (คณะกรรมการ 4 ฝ่าย) มีหน้าที่จัดทำข้อยุติเพื่อเสนอให้นายกรัฐมนตรีพิจารณาดำเนินการตามอำนาจหน้าที่ให้สอดคล้องกับบทบัญญัติรัฐธรรมนูญแห่งราชอาณาจักรไทย มาตรา 67 วรรคสอง',
            '1 ธันวาคม 2552 การแก้ไขปัญหาเร่งด่วนของประชาชน และการลดและขจัดมลพิษในพื้นที่มาบตาพุดและบริเวณใกล้เคียง โดยหน่วยงานต่างๆ ได้รับอนุมัติจากคณะรัฐมนตรีให้ดำเนินโครงการมาโดยลำดับ 4 ครั้ง จำนวนรวม 32 โครงการ วงเงินรวม 1,432 ล้านบาท',
            '8 กรกฎาคม 2553 จัดทำแผนปฏิบัติการเพื่อลดและขจัดมลพิษในเขตควบคุมมลพิษ จังหวัดระยอง พ.ศ. 2553-2556 ประกอบด้วย 7 แผนงาน 71 โครงการ วงเงินรวม 2,182 ล้านบาท',
            '1 ธันวาคม 2552 การแก้ไขปัญหาเร่งด่วนของประชาชน และการลดและขจัดมลพิษในพื้นที่มาบตาพุดและบริเวณใกล้เคียง โดยหน่วยงานต่างๆ ได้รับอนุมัติจากคณะรัฐมนตรีให้ดำเนินโครงการมาโดยลำดับ 4 ครั้ง จำนวนรวม 32 โครงการ วงเงินรวม 1,432 ล้านบาท'
        ]
    },
    2553: {
        'fullname'  : 'น.ส.ยิ่งลักษณ์ ชินวัตร',
        'hold_years': 'พศ.2553 - ปัจจุบัน',
        'events'    : [
            '4 เมษายน 2554 ที่ประชุมครม. มีมติเห็นชอบแผนการแก้ไขปัญหามาบตาพุดอย่างครบวงจร ระยะเวลา 5 ปี 2555-2559 ตามที่สำนักงานคณะกรรมการพัฒนาการเศรษฐกิจและสังคมแห่งชาติ (สศช.)เสนอ มีโครงการที่ต้องดำเนินงานกว่า 92 โครงการ วงเงินรวม 4,347 ล้านบาท'
        ]
    },
};

$(document).ready(function() {
    var svggraph = $('#svggraph').svg()
    svggraph.load('graph.svg?'+Math.random(), 'get', function (svg) {
        var data = $('svg > g', $('#svggraph'))
        window.activeLayers2 = []

        window.gr2 = _.groupBy(data, function(i) {
            return i.id.split('_')[0] || 'other'
        })

        // CREATE LAYER MANAGER
        window.LayerManager2 = CreateLayerManager(gr2, activeLayers2) // LAYER MANAGER
        LayerManager2.show('graph', ['Factory', 'Accident', 'Event', 'GPP'])

        // BIND EVENT
        bindEvent(LayerManager2.funcs['graph-Factory'].data(), jQuery('[id$="factoryBubble"]'))
        bindEvent(LayerManager2.funcs['graph-GPP'].data(), jQuery('[id$="gppBubble"]'))

        // ON PRIMINISTER CLICK
        $('image[id$="primeMinister"]').click(function(){
            var pmId = $(this).attr('id').split('-')[0];
            $.colorbox({
                html        :buildPMInfo(pmId),
                width       :"30%",
                opacity     :0,
                transition  :'none'
            });
            });
    })
    
    function buildPMInfo(year) {
        var pm = pmList[year];
        var events_html = "<ul>";
        _.each(pm['events'], function(data) {
            events_html += '<li>' + data + '</li>';
        })
        events_html += "</ul>";
        return "<div><p class='fullname'>" + pm['fullname'] + "</p><p class='holdyear'>" + pm['hold_years'] + "</p><p class='events'>" + events_html + "</p></div>";
    }

    function bindEvent(data, bubble) {
        var bindBubble = function(v, idx) {
            var t1;
            $(v).mouseenter(function(e) {
                t1 = new Date();
                console.log('enter')
                var $this = $(this);
                $this.css({'opacity': 1.0, 'cursor': 'pointer'});
                bubble.hide()
                e.stopPropagation()
                bubble.eq(idx).show()
            })
            .mouseleave(function(e){
                var t2 = new Date();
                var diff = t2 - t1;
                console.log(diff)
                if (diff>80) {
                    bubble.eq(idx).fadeOut()
                }
                else {
                   setTimeout(function() {
                        bubble.eq(idx).fadeOut()
                    }, 300)
                }
            })
        }
        // _.each($('line', data), function(v, idx) {
        //         bindBubble(v, idx)
        // })

        _.each($('circle', data), function(v, idx) {
                bindBubble(v, idx)
        })
    }


})